{
  "lesson_id": "ntf05_lesson_01",
  "course_id": "new_testament_foundations_05_acts",
  "sequence": 1,
  "title": "Promise and Ascension",
  "objective": "Understand Jesus' final instructions, the promise of the Holy Spirit, and the mission launched from His ascension.",
  "duration": "9 minutes",
  "prerequisite": "ntf04_lesson_12",
  "required_passages": [
    {
      "passage_id": "act_1_1_26",
      "reference": "Acts 1:1-26",
      "text": "In the first book, O Theophilus, I have dealt with all that Jesus began to do and teach... He presented himself alive to them after his suffering by many proofs... He ordered them not to depart from Jerusalem, but to wait for the promise of the Father... 'You will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.' ... he was lifted up, and a cloud took him out of their sight... 'This Jesus... will come in the same way as you saw him go into heaven.' ... they devoted themselves to prayer... Matthias was numbered with the eleven apostles."
    }
  ],
  "segments": [
    {"segment_id":"orientation","type":"orientation","audio_script":"Acts begins the story of Jesus continuing His work through the Spirit-filled church. Today we see the promise, the mission, and the ascension."},
    {"segment_id":"reading","type":"reading","audio_script":"Listen to Acts 1. Jesus appeared alive after His suffering and taught about the kingdom. He commanded the disciples to wait in Jerusalem for the promise of the Father: 'You will be baptized with the Holy Spirit.' They asked, 'Lord, will you at this time restore the kingdom to Israel?' Jesus replied, 'It is not for you to know times or seasons... but you will receive power when the Holy Spirit has come upon you, and you will be my witnesses... to the end of the earth.' After saying this, He was lifted up, and a cloud took Him out of their sight. Two men in white said, 'This Jesus... will come in the same way.' The disciples returned to Jerusalem and devoted themselves to prayer. Peter led the believers to replace Judas, and Matthias was chosen."},
    {"segment_id":"context","type":"context","audio_script":"Luke writes Acts as volume two after his Gospel. Jesus has risen and now commissions His people. Acts 1:8 provides the book's outline: Jerusalem, Judea-Samaria, then the nations. The apostles wait in obedience, pray in unity, and prepare leadership."},
    {"segment_id":"analysis","type":"analysis","audio_script":"The ascension is not Jesus' absence but His enthronement. The mission is impossible without the Spirit's power. Waiting is not passivity—it is faithful preparation through prayer and Scripture. Replacing Judas restores apostolic witness to the resurrection and prepares for Pentecost."},
    {"segment_id":"themes","type":"themes","audio_script":"Key themes include Jesus' ongoing reign, Spirit-empowered witness, global mission, prayerful dependence, obedience while waiting, apostolic authority, and hope in Christ's return."},
    {"segment_id":"question","type":"question","audio_script":"Reflect on this: Are you trying to witness in your own strength, or waiting on Spirit power? How does Jesus' ascension shape your confidence in mission?"},
    {"segment_id":"close","type":"close","audio_script":"Jesus ascends as reigning Lord and sends His church into the world by the Spirit's power. Next, Pentecost ignites the mission."}
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "acts",
    "chapter_range": "1",
    "theological_themes": ["ascension", "holy_spirit", "mission", "witness", "prayer", "second_coming"],
    "time_period": "circa_30_ad",
    "canonical_order": 44
  }
}
