{
  "lesson_id": "ntf05_lesson_04",
  "course_id": "new_testament_foundations_05_acts",
  "sequence": 4,
  "title": "Purity, Service, and Witness",
  "objective": "Understand God's holiness in the church, servant leadership, and Stephen's faithful witness unto death.",
  "duration": "10 minutes",
  "prerequisite": "ntf05_lesson_03",
  "required_passages": [
    {
      "passage_id": "act_5_1_7_60",
      "reference": "Acts 5:1-7:60",
      "text": "Ananias and Sapphira lied to the Holy Spirit... great fear came upon the whole church... the apostles were arrested and released by an angel... 'We must obey God rather than men.' ... seven men were appointed to serve... Stephen, full of grace and power... gave testimony of Israel's history and accused resistance to the Spirit... they stoned Stephen, and he prayed, 'Lord Jesus, receive my spirit' and 'do not hold this sin against them.'"
    }
  ],
  "segments": [
    {"segment_id":"orientation","type":"orientation","audio_script":"Church growth is matched by testing. Today we see God's holiness, wise leadership development, and Stephen's martyrdom."},
    {"segment_id":"reading","type":"reading","audio_script":"Listen to Acts 5 through 7. Ananias and Sapphira lied about their gift, and Peter said they lied to the Holy Spirit; both fell dead, and great fear came upon all. The apostles performed many signs, were arrested, and an angel released them to keep preaching. Before the council they declared, 'We must obey God rather than men.' Gamaliel advised caution. As disciples increased, a complaint arose over neglected widows. The apostles appointed seven Spirit-filled servants, including Stephen. Stephen performed signs and was seized. In his speech, he retold Israel's history, showing repeated rejection of God's messengers and culminating in rejection of the Righteous One. Enraged leaders stoned him. Stephen saw Jesus standing at God's right hand and prayed for mercy on his killers as he died."},
    {"segment_id":"context","type":"context","audio_script":"Rapid growth brings both external persecution and internal challenges. Luke shows that Spirit-filled leadership includes both word ministry and practical care. Stephen's speech reframes temple-centered religion around Jesus as the true fulfillment."},
    {"segment_id":"analysis","type":"analysis","audio_script":"Holiness matters in gospel community; hypocrisy is not trivial. The apostles prioritize prayer and word while empowering others to serve, creating healthy ministry structure. Stephen models scriptural faithfulness and Christlike forgiveness at death. His martyrdom becomes a turning point that scatters believers for mission."},
    {"segment_id":"themes","type":"themes","audio_script":"Key themes include holiness before God, honesty in community, obedience above human authority, shared leadership, Spirit-filled service, biblical theology of fulfillment in Christ, martyr witness, and forgiving enemies."},
    {"segment_id":"question","type":"question","audio_script":"Reflect on this: Where does hidden hypocrisy need repentance? How can your community strengthen both word and mercy ministries? Are you prepared to witness faithfully at personal cost?"},
    {"segment_id":"close","type":"close","audio_script":"God purifies and strengthens His church through testing. Next, the gospel moves beyond Jerusalem through persecution and conversion."}
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "acts",
    "chapter_range": "5-7",
    "theological_themes": ["holiness", "church_discipline", "leadership", "service", "martyrdom", "forgiveness", "obedience"],
    "time_period": "circa_31_ad",
    "canonical_order": 44
  }
}
