{
  "lesson_id": "ntf05_lesson_06",
  "course_id": "new_testament_foundations_05_acts",
  "sequence": 6,
  "title": "One Gospel for All",
  "objective": "See how God welcomes Gentiles through Cornelius and how the church discerns the Spirit's work among all peoples.",
  "duration": "10 minutes",
  "prerequisite": "ntf05_lesson_05",
  "required_passages": [
    {
      "passage_id": "act_10_1_12_25",
      "reference": "Acts 10:1-12:25",
      "text": "Cornelius, a centurion... saw an angel... Peter saw a vision of unclean animals and heard, 'What God has made clean, do not call common.' ... Peter preached Jesus in Cornelius's house... 'everyone who believes in him receives forgiveness of sins through his name.' ... the Holy Spirit fell on all who heard... they were baptized... the Jerusalem believers glorified God: 'Then to the Gentiles also God has granted repentance that leads to life.' ... the church in Antioch grew... Barnabas brought Saul... disciples were first called Christians... Herod executed James and imprisoned Peter; God delivered Peter by an angel."
    }
  ],
  "segments": [
    {"segment_id":"orientation","type":"orientation","audio_script":"A major turning point arrives: Gentiles receive the same gospel and Spirit. Today we watch barriers fall and the church become visibly multiethnic."},
    {"segment_id":"reading","type":"reading","audio_script":"Listen to Acts 10 through 12. Cornelius, a God-fearing centurion, received an angelic message to send for Peter. Meanwhile Peter saw a vision and heard, 'What God has made clean, do not call common.' In Cornelius's house Peter proclaimed Jesus—His life, death, and resurrection—and declared that everyone who believes receives forgiveness through His name. While Peter spoke, the Holy Spirit fell on the Gentiles, and they praised God. Peter commanded they be baptized. Back in Jerusalem, Peter explained the Spirit's work, and the believers glorified God for granting Gentiles repentance unto life. In Antioch many believed; Barnabas and Saul taught there, and disciples were first called Christians. Herod killed James, jailed Peter, but God delivered Peter by an angel as the church prayed earnestly."},
    {"segment_id":"context","type":"context","audio_script":"Jew-Gentile separation shaped first-century identity. God directly intervenes through visions and Spirit outpouring to show full inclusion of Gentiles in Christ. Antioch emerges as a strategic mission center."},
    {"segment_id":"analysis","type":"analysis","audio_script":"God shows no partiality: salvation is by faith in Jesus for all peoples. The same Spirit, same gospel, and same baptism mark equal belonging. The church must adjust tradition to God's revealed mission. Prayer remains central amid persecution."},
    {"segment_id":"themes","type":"themes","audio_script":"Key themes include impartial grace, Gentile inclusion, Spirit confirmation, repentance unto life, church discernment, Antioch mission culture, persecution, and deliverance through prayer."},
    {"segment_id":"question","type":"question","audio_script":"Reflect on this: Are there people you still treat as outsiders to grace? How can your church better reflect the one gospel for all nations?"},
    {"segment_id":"close","type":"close","audio_script":"God opens the door wide to the nations. Next, Paul and Barnabas are sent as missionaries from Antioch."}
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "acts",
    "chapter_range": "10-12",
    "theological_themes": ["gentile_inclusion", "holy_spirit", "forgiveness", "unity", "antioch", "prayer", "persecution"],
    "time_period": "circa_41_ad",
    "canonical_order": 44
  }
}
