{
  "lesson_id": "ntf07_lesson_18",
  "course_id": "new_testament_foundations_07_general_epistles_revelation",
  "sequence": 18,
  "title": "Revelation: Final Judgment",
  "objective": "Trace the final defeat of Satan, resurrection, and the great white throne judgment.",
  "duration": "9 minutes",
  "prerequisite": "ntf07_lesson_17",
  "required_passages": [{"passage_id":"rev_20_1_15","reference":"Revelation 20:1-15","text":"Satan was bound... then released... and thrown into the lake of fire... the dead were judged... if anyone's name was not found written in the book of life, he was thrown into the lake of fire."}],
  "segments": [
    {"segment_id":"orientation","type":"orientation","audio_script":"Revelation 20 presents ultimate accountability and the final end of evil."},
    {"segment_id":"reading","type":"reading","audio_script":"Listen to Revelation 20. Satan is bound, later released for a final rebellion, then decisively defeated and cast into the lake of fire. John sees the great white throne where the dead are judged according to deeds, and anyone not found in the book of life faces the second death."},
    {"segment_id":"context","type":"context","audio_script":"This chapter has interpretive debates, yet its central message is clear: evil is temporary and God's justice final."},
    {"segment_id":"analysis","type":"analysis","audio_script":"History moves toward God's righteous judgment, not endless cycles. Final justice vindicates holiness and exposes every unrepentant allegiance against God."},
    {"segment_id":"themes","type":"themes","audio_script":"Key themes include Satan's defeat, resurrection, final judgment, book of life, and ultimate justice."},
    {"segment_id":"question","type":"question","audio_script":"Reflect on this: How does certain final judgment shape your urgency for repentance, holiness, and witness today?"},
    {"segment_id":"close","type":"close","audio_script":"Evil ends under God's justice. Next, Scripture closes with new creation and eternal communion with God."}
  ],
  "metadata": {"difficulty":"intermediate","testament":"new","book":"revelation","chapter_range":"20","theological_themes":["final_judgment","resurrection","book_of_life","justice","satan_defeat"],"time_period":"circa_95_ad","canonical_order":66}
}
