{
  "lesson_id": "ntf01_lesson_12",
  "course_id": "new_testament_foundations_01_matthew",
  "sequence": 12,
  "title": "The Passion and Resurrection",
  "objective": "Experience the climactic events of Jesus' death and resurrection, the foundation of Christian faith and hope.",
  "duration": "10 minutes",
  "prerequisite": "ntf01_lesson_11",
  "required_passages": [
    {
      "passage_id": "mat_26_1_28_20",
      "reference": "Matthew 26:1-28:20",
      "text": "When Jesus had finished all these sayings, he said to his disciples, 'You know that after two days the Passover is coming, and the Son of Man will be delivered up to be crucified.' Then the chief priests and the elders of the people gathered in the palace of the high priest, whose name was Caiaphas, and plotted together in order to arrest Jesus by stealth and kill him. Then one of the twelve, whose name was Judas Iscariot, went to the chief priests and said, 'What will you give me if I deliver him over to you?' And they paid him thirty pieces of silver. Now on the first day of Unleavened Bread the disciples came to Jesus, saying, 'Where will you have us prepare for you to eat the Passover?' And he said, 'Go into the city to a certain man and say to him, The Teacher says, My time is at hand. I will keep the Passover at your house with my disciples.' Now as they were eating, Jesus took bread, and after blessing it broke it and gave it to the disciples, and said, 'Take, eat; this is my body.' And he took a cup, and when he had given thanks he gave it to them, saying, 'Drink of it, all of you, for this is my blood of the covenant, which is poured out for many for the forgiveness of sins.' Then Jesus went with them to a place called Gethsemane, and he said to his disciples, 'Sit here, while I go over there and pray.' And taking with him Peter and the two sons of Zebedee, he began to be sorrowful and troubled. Then he said to them, 'My soul is very sorrowful, even to death; remain here, and watch with me.' And going a little farther he fell on his face and prayed, saying, 'My Father, if it be possible, let this cup pass from me; nevertheless, not as I will, but as you will.' While he was still speaking, Judas came, one of the twelve, and with him a great crowd with swords and clubs, from the chief priests and the elders of the people. Now the betrayer had given them a sign, saying, 'The one I will kiss is the man; seize him.' And he came up to Jesus at once and said, 'Greetings, Rabbi!' And he kissed him. Then they seized Jesus and arrested him. Now Peter was sitting outside in the courtyard. And a servant girl came up to him and said, 'You also were with Jesus the Galilean.' But he denied it before them all, saying, 'I do not know what you mean.' And Peter remembered the saying of Jesus, 'Before the rooster crows, you will deny me three times.' And he went out and wept bitterly. When morning came, all the chief priests and the elders of the people took counsel against Jesus to put him to death. And they bound him and led him away and delivered him over to Pilate the governor. So when Pilate saw that he was gaining nothing, but rather that a riot was beginning, he took water and washed his hands before the crowd, saying, 'I am innocent of this man's blood; see to it yourselves.' And all the people answered, 'His blood be on us and on our children!' Then he released for them Barabbas, and having scourged Jesus, delivered him to be crucified. And when they had crucified him, they divided his garments among them by casting lots. And those who passed by derided him, wagging their heads and saying, 'You who would destroy the temple and rebuild it in three days, save yourself! If you are the Son of God, come down from the cross.' And about the ninth hour Jesus cried out with a loud voice, saying, 'Eli, Eli, lema sabachthani?' that is, 'My God, my God, why have you forsaken me?' And Jesus cried out again with a loud voice and yielded up his spirit. And behold, the curtain of the temple was torn in two, from top to bottom. And the earth shook, and the rocks were split. When the centurion and those who were with him, keeping watch over Jesus, saw the earthquake and what took place, they were filled with awe and said, 'Truly this was the Son of God!' Now after the Sabbath, toward the dawn of the first day of the week, Mary Magdalene and the other Mary went to see the tomb. And behold, there was a great earthquake, for an angel of the Lord descended from heaven and came and rolled back the stone and sat on it. His appearance was like lightning, and his clothing white as snow. And for fear of him the guards trembled and became like dead men. But the angel said to the women, 'Do not be afraid, for I know that you seek Jesus who was crucified. He is not here, for he has risen, as he said. Come, see the place where he lay. Then go quickly and tell his disciples that he has risen from the dead, and behold, he is going before you to Galilee; there you will see him. See, I have told you.' So they departed quickly from the tomb with fear and great joy, and ran to tell his disciples. And behold, Jesus met them and said, 'Greetings!' And they came up and took hold of his feet and worshiped him. Now the eleven disciples went to Galilee, to the mountain to which Jesus had directed them. And when they saw him they worshiped him, but some doubted. And Jesus came and said to them, 'All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you. And behold, I am with you always, to the end of the age.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson twelve, our final lesson in Matthew. We now approach the Gospel's climax: Jesus' suffering, death, and resurrection. These events form the heart of the Christian faith and fulfill all that came before."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to key passages from Matthew chapters 26 through 28. Jesus said to his disciples, 'You know that after two days the Passover is coming, and the Son of Man will be delivered up to be crucified.' Then one of the twelve, whose name was Judas Iscariot, went to the chief priests and said, 'What will you give me if I deliver him over to you?' And they paid him thirty pieces of silver. Now as they were eating, Jesus took bread, and after blessing it broke it and gave it to the disciples, and said, 'Take, eat; this is my body.' And he took a cup, and when he had given thanks he gave it to them, saying, 'Drink of it, all of you, for this is my blood of the covenant, which is poured out for many for the forgiveness of sins.' Then Jesus went with them to a place called Gethsemane, and he began to be sorrowful and troubled. And going a little farther he fell on his face and prayed, saying, 'My Father, if it be possible, let this cup pass from me; nevertheless, not as I will, but as you will.' While he was still speaking, Judas came, and with him a great crowd with swords and clubs. And he came up to Jesus at once and said, 'Greetings, Rabbi!' And he kissed him. Then they seized Jesus and arrested him. And having scourged Jesus, they delivered him to be crucified. And about the ninth hour Jesus cried out with a loud voice, saying, 'My God, my God, why have you forsaken me?' And Jesus cried out again with a loud voice and yielded up his spirit. And behold, the curtain of the temple was torn in two, from top to bottom. When the centurion saw what took place, he said, 'Truly this was the Son of God!' Now after the Sabbath, toward the dawn of the first day of the week, Mary Magdalene and the other Mary went to see the tomb. But the angel said to the women, 'Do not be afraid, for I know that you seek Jesus who was crucified. He is not here, for he has risen, as he said. Come, see the place where he lay.' And Jesus came and said to them, 'All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you. And behold, I am with you always, to the end of the age.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus' death occurred during Passover, linking His sacrifice to Israel's liberation from Egypt. Religious leaders conspired, Judas betrayed, Peter denied, and Rome executed. Yet God orchestrated redemption through these human failures. The torn temple curtain signified direct access to God through Christ's death."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The Last Supper instituted communion, pointing to His body and blood given for covenant forgiveness. Gethsemane revealed His full humanity struggling with the cup of wrath. The cry of dereliction showed Him bearing sin's penalty. But the empty tomb vindicated everything. The Great Commission extends His authority to all nations through His disciples."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Central themes include substitutionary atonement, covenant fulfillment, Jesus' obedience unto death, God's sovereignty over evil, resurrection power, and the global mission mandate. Death and resurrection form the foundation for reconciliation with God and transformation of the world."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: How does Jesus' Gethsemane prayer model submitting your will to God's? What does the torn curtain mean for your access to God? How should the resurrection and Great Commission shape your life purpose?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Matthew's Gospel concludes with resurrection triumph and the promise of Christ's presence until the end. We've journeyed from genealogy to empty tomb, from birth to Great Commission. Jesus is Immanuel, God with us, forever. Congratulations on completing the Gospel of Matthew!"
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "matthew",
    "chapter_range": "26-28",
    "theological_themes": ["crucifixion", "resurrection", "atonement", "covenant", "great_commission", "sacrifice"],
    "time_period": "circa_30_33_ad",
    "canonical_order": 40
  }
}
