{
  "lesson_id": "ntf03_lesson_09",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 9,
  "title": "Warnings and Wisdom",
  "objective": "Learn Jesus' teaching on fear, greed, readiness, and repentance as He journeys toward Jerusalem.",
  "duration": "9 minutes",
  "prerequisite": "ntf03_lesson_08",
  "required_passages": [
    {
      "passage_id": "luk_12_1_13_35",
      "reference": "Luke 12:1-13:35",
      "text": "In the meantime, when so many thousands of the people had gathered together that they were trampling one another, he began to say to his disciples first, 'Beware of the leaven of the Pharisees, which is hypocrisy. Nothing is covered up that will not be revealed, or hidden that will not be known. Therefore whatever you have said in the dark shall be heard in the light, and what you have whispered in private rooms shall be proclaimed on the housetops. I tell you, my friends, do not fear those who kill the body, and after that have nothing more that they can do. But I will warn you whom to fear: fear him who, after he has killed, has authority to cast into hell. Yes, I tell you, fear him! Are not five sparrows sold for two pennies? And not one of them is forgotten before God. Why, even the hairs of your head are all numbered. Fear not; you are of more value than many sparrows. And I tell you, everyone who acknowledges me before men, the Son of Man also will acknowledge before the angels of God, but the one who denies me before men will be denied before the angels of God.' One of the crowd said to him, 'Teacher, tell my brother to divide the inheritance with me.' But he said to him, 'Man, who made me a judge or arbitrator over you?' And he said to them, 'Take care, and be on your guard against all covetousness, for one's life does not consist in the abundance of his possessions.' And he told them a parable, saying, 'The land of a rich man produced plentifully, and he thought to himself, \"What shall I do, for I have nowhere to store my crops?\" And he said, \"I will do this: I will tear down my barns and build larger ones, and there I will store all my grain and my goods. And I will say to my soul, 'Soul, you have ample goods laid up for many years; relax, eat, drink, be merry.'\" But God said to him, \"Fool! This night your soul is required of you, and the things you have prepared, whose will they be?\" So is the one who lays up treasure for himself and is not rich toward God.' And he said to his disciples, 'Therefore I tell you, do not be anxious about your life, what you will eat, nor about your body, what you will put on. For life is more than food, and the body more than clothing. Consider the ravens: they neither sow nor reap, they have neither storehouse nor barn, and yet God feeds them. Of how much more value are you than the birds! And which of you by being anxious can add a single hour to his span of life? If then you are not able to do as small a thing as that, why are you anxious about the rest? Consider the lilies, how they grow: they neither toil nor spin, yet I tell you, even Solomon in all his glory was not arrayed like one of these. But if God so clothes the grass, which is alive in the field today, and tomorrow is thrown into the oven, how much more will he clothe you, O you of little faith! And do not seek what you are to eat and what you are to drink, nor be worried. For all the nations of the world seek after these things, and your Father knows that you need them. Instead, seek his kingdom, and these things will be added to you. Fear not, little flock, for it is your Father's good pleasure to give you the kingdom. Sell your possessions, and give to the needy. Provide yourselves with moneybags that do not grow old, with a treasure in the heavens that does not fail, where no thief approaches and no moth destroys. For where your treasure is, there will your heart be also. Stay dressed for action and keep your lamps burning, and be like men who are waiting for their master to come home from the wedding feast, so that they may open the door to him at once when he comes and knocks. Blessed are those servants whom the master finds awake when he comes. Truly, I say to you, he will dress himself for service and have them recline at table, and he will come and serve them. If he comes in the second watch, or in the third, and finds them awake, blessed are those servants! But know this, that if the master of the house had known at what hour the thief was coming, he would not have left his house to be broken into. You also must be ready, for the Son of Man is coming at an hour you do not expect.' Peter said, 'Lord, are you telling this parable for us or for all?' And the Lord said, 'Who then is the faithful and wise manager, whom his master will set over his household, to give them their portion of food at the proper time? Blessed is that servant whom his master will find so doing when he comes. Truly, I say to you, he will set him over all his possessions. But if that servant says to himself, \"My master is delayed in coming,\" and begins to beat the male and female servants, and to eat and drink and get drunk, the master of that servant will come on a day when he does not expect him and at an hour he does not know, and will cut him in pieces and put him with the unfaithful. And that servant who knew his master's will but did not get ready or act according to his will, will receive a severe beating. But the one who did not know, and did what deserved a beating, will receive a light beating. Everyone to whom much was given, of him much will be required, and from him to whom they entrusted much, they will demand the more. I came to cast fire on the earth, and would that it were already kindled! I have a baptism to be baptized with, and how great is my distress until it is accomplished! Do you think that I have come to give peace on earth? No, I tell you, but rather division.' There were some present at that very time who told him about the Galileans whose blood Pilate had mingled with their sacrifices. And he answered them, 'Do you think that these Galileans were worse sinners than all the other Galileans, because they suffered in this way? No, I tell you; but unless you repent, you will all likewise perish. Or those eighteen on whom the tower in Siloam fell and killed them: do you think that they were worse offenders than all the others who lived in Jerusalem? No, I tell you; but unless you repent, you will all likewise perish.' And he told this parable: 'A man had a fig tree planted in his vineyard, and he came seeking fruit on it and found none. And he said to the vinedresser, \"Look, for three years now I have come seeking fruit on this fig tree, and I find none. Cut it down. Why should it use up the ground?\" And he answered him, \"Sir, let it alone this year also, until I dig around it and put on manure. Then if it should bear fruit next year, well and good; but if not, you can cut it down.\"' Now he was teaching in one of the synagogues on the Sabbath. And behold, there was a woman who had had a disabling spirit for eighteen years. She was bent over and could not fully straighten herself. When Jesus saw her, he called her over and said to her, 'Woman, you are freed from your disability.' And he laid his hands on her, and immediately she was made straight, and she glorified God. But the ruler of the synagogue, indignant because Jesus had healed on the Sabbath, said to the people, 'There are six days in which work ought to be done. Come on those days and be healed, and not on the Sabbath day.' Then the Lord answered him, 'You hypocrites! Does not each of you on the Sabbath untie his ox or his donkey from the manger and lead it away to water it? And ought not this woman, a daughter of Abraham whom Satan bound for eighteen years, be loosed from this bond on the Sabbath day?' As he said these things, all his adversaries were put to shame, and all the people rejoiced at all the glorious things that were done by him. He said therefore, 'What is the kingdom of God like? And to what shall I compare it? It is like a grain of mustard seed that a man took and sowed in his garden, and it grew and became a tree, and the birds of the air made nests in its branches.' And again he said, 'To what shall I compare the kingdom of God? It is like leaven that a woman took and hid in three measures of flour, until it was all leavened.' He went on his way through towns and villages, teaching and journeying toward Jerusalem. And someone said to him, 'Lord, will those who are saved be few?' And he said to them, 'Strive to enter through the narrow door. For many, I tell you, will seek to enter and will not be able. When once the master of the house has risen and shut the door, and you begin to stand outside and to knock at the door, saying, \"Lord, open to us,\" then he will answer you, \"I do not know where you come from.\" Then you will begin to say, \"We ate and drank in your presence, and you taught in our streets.\" But he will say, \"I tell you, I do not know where you come from. Depart from me, all you workers of evil!\" In that place there will be weeping and gnashing of teeth, when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God but you yourselves cast out. And people will come from east and west, and from north and south, and recline at table in the kingdom of God. And behold, some are last who will be first, and some are first who will be last.' At that very hour some Pharisees came and said to him, 'Get away from here, for Herod wants to kill you.' And he said to them, 'Go and tell that fox, \"Behold, I cast out demons and perform cures today and tomorrow, and the third day I finish my course. Nevertheless, I must go on my way today and tomorrow and the day following, for it cannot be that a prophet should perish away from Jerusalem.\" O Jerusalem, Jerusalem, the city that kills the prophets and stones those who are sent to it! How often would I have gathered your children together as a hen gathers her brood under her wings, and you were not willing! Behold, your house is forsaken. And I tell you, you will not see me until you say, \"Blessed is he who comes in the name of the Lord!\"'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus teaches urgently as He approaches Jerusalem. Today we hear warnings against hypocrisy, greed, and complacency, calls to trust God, readiness for His return, urgent repentance, and lament over Jerusalem's rejection."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to key passages from Luke 12 and 13. He said to his disciples, 'Beware of the leaven of the Pharisees, which is hypocrisy. Nothing is covered up that will not be revealed. I tell you, do not fear those who kill the body. But fear him who has authority to cast into hell. Are not five sparrows sold for two pennies? And not one is forgotten before God. Fear not; you are of more value than many sparrows.' He said, 'Take care against all covetousness, for one's life does not consist in the abundance of possessions.' A rich man said, 'Soul, you have ample goods laid up for many years; relax, eat, drink, be merry.' But God said, 'Fool! This night your soul is required of you.' So is the one who lays up treasure for himself and is not rich toward God. 'Do not be anxious about your life. Consider the ravens: God feeds them. Consider the lilies: even Solomon was not arrayed like one of these. Seek his kingdom, and these things will be added. Fear not, little flock. Sell your possessions, and give to the needy. For where your treasure is, there will your heart be also. Stay dressed for action and keep your lamps burning. Blessed are those servants whom the master finds awake. You also must be ready, for the Son of Man is coming at an hour you do not expect. Everyone to whom much was given, of him much will be required.' There were some who told him about the Galileans whose blood Pilate had mingled with their sacrifices. And he answered, 'Unless you repent, you will all likewise perish.' A man had a fig tree planted in his vineyard. He came seeking fruit and found none. 'Cut it down,' he said. But the vinedresser answered, 'Sir, let it alone this year also, until I dig around it and put on manure.' Someone said, 'Lord, will those who are saved be few?' And he said, 'Strive to enter through the narrow door. For many will seek to enter and will not be able. Depart from me, all you workers of evil! O Jerusalem, Jerusalem, the city that kills the prophets! How often would I have gathered your children together, and you were not willing! Behold, your house is forsaken.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus warns against Pharisaic hypocrisy that will be exposed. He addresses greed with the parable of the rich fool who trusts possessions instead of God. He calls disciples to trust the Father's provision, not anxiety. He warns servants to stay ready for the master's return. Tragedy prompts urgent call to repentance. Jerusalem's rejection brings lamentation."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Hypocrisy will be revealed; fear God, not people. The rich fool's self-sufficiency ignores mortality and God. Anxiety reveals little faith; God provides for His children. Treasure reflects heart priorities. Servants must stay ready for uncertain return. Much given requires much. Israel's patience runs out like the fig tree. The narrow door requires striving. Jerusalem's house is forsaken for rejecting God's messengers."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include hypocrisy being exposed, proper fear of God, danger of greed and materialism, trust replacing anxiety, generosity and heavenly treasure, readiness for Jesus' return, faithful stewardship, urgent repentance, God's patience with limits, narrow way to salvation, and Jesus' grief over Jerusalem's rejection. Luke emphasizes warnings alongside compassion."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: What hypocrisy needs exposing in your life? Where is your treasure—does it reflect your heart? Are you ready for Jesus' return? What fruit is your life bearing? Are you striving to enter the narrow door?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus urgently warns against greed, anxiety, and complacency. He calls for readiness, repentance, and striving to enter the kingdom. Jerusalem's rejection brings sorrow. Next, more parables of grace. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "12-13",
    "theological_themes": ["hypocrisy", "greed", "anxiety", "trust", "readiness", "stewardship", "repentance", "judgment", "jerusalem"],
    "time_period": "circa_29_ad",
    "canonical_order": 42
  }
}
