{
  "lesson_id": "ntf03_lesson_08",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 8,
  "title": "The Journey Begins",
  "objective": "Follow Jesus' journey to Jerusalem as He teaches about discipleship, prayer, and the kingdom.",
  "duration": "10 minutes",
  "prerequisite": "ntf03_lesson_07",
  "required_passages": [
    {
      "passage_id": "luk_9_51_11_54",
      "reference": "Luke 9:51-11:54",
      "text": "When the days drew near for him to be taken up, he set his face to go to Jerusalem. And he sent messengers ahead of him, who went and entered a village of the Samaritans, to make preparations for him. But the people did not receive him, because his face was set toward Jerusalem. And when his disciples James and John saw it, they said, 'Lord, do you want us to tell fire to come down from heaven and consume them?' But he turned and rebuked them. And they went on to another village. As they were going along the road, someone said to him, 'I will follow you wherever you go.' And Jesus said to him, 'Foxes have holes, and birds of the air have nests, but the Son of Man has nowhere to lay his head.' To another he said, 'Follow me.' But he said, 'Lord, let me first go and bury my father.' And Jesus said to him, 'Leave the dead to bury their own dead. But as for you, go and proclaim the kingdom of God.' Yet another said, 'I will follow you, Lord, but let me first say farewell to those at my home.' Jesus said to him, 'No one who puts his hand to the plow and looks back is fit for the kingdom of God.' After this the Lord appointed seventy-two others and sent them on ahead of him, two by two, into every town and place where he himself was about to go. And he said to them, 'The harvest is plentiful, but the laborers are few. Therefore pray earnestly to the Lord of the harvest to send out laborers into his harvest. Go your way; behold, I am sending you out as lambs in the midst of wolves. Carry no moneybag, no knapsack, no sandals, and greet no one on the road. Whatever house you enter, first say, \"Peace be to this house!\" And if a son of peace is there, your peace will rest upon him. But if not, it will return to you. And remain in the same house, eating and drinking what they provide, for the laborer deserves his wages. Do not go from house to house. Whenever you enter a town and they receive you, eat what is set before you. Heal the sick in it and say to them, \"The kingdom of God has come near to you.\" But whenever you enter a town and they do not receive you, go into its streets and say, \"Even the dust of your town that clings to our feet we wipe off against you. Nevertheless know this, that the kingdom of God has come near.\" The seventy-two returned with joy, saying, 'Lord, even the demons are subject to us in your name!' And he said to them, 'I saw Satan fall like lightning from heaven. Behold, I have given you authority to tread on serpents and scorpions, and over all the power of the enemy, and nothing shall hurt you. Nevertheless, do not rejoice in this, that the spirits are subject to you, but rejoice that your names are written in heaven.' And behold, a lawyer stood up to put him to the test, saying, 'Teacher, what shall I do to inherit eternal life?' He said to him, 'What is written in the Law? How do you read it?' And he answered, 'You shall love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind, and your neighbor as yourself.' And he said to him, 'You have answered correctly; do this, and you will live.' But he, desiring to justify himself, said to Jesus, 'And who is my neighbor?' Jesus replied, 'A man was going down from Jerusalem to Jericho, and he fell among robbers, who stripped him and beat him and departed, leaving him half dead. Now by chance a priest was going down that road, and when he saw him he passed by on the other side. So likewise a Levite, when he came to the place and saw him, passed by on the other side. But a Samaritan, as he journeyed, came to where he was, and when he saw him, he had compassion. He went to him and bound up his wounds, pouring on oil and wine. Then he set him on his own animal and brought him to an inn and took care of him. And the next day he took out two denarii and gave them to the innkeeper, saying, \"Take care of him, and whatever more you spend, I will repay you when I come back.\" Which of these three, do you think, proved to be a neighbor to the man who fell among the robbers?' He said, 'The one who showed him mercy.' And Jesus said to him, 'You go, and do likewise.' Now as they went on their way, Jesus entered a village. And a woman named Martha welcomed him into her house. And she had a sister called Mary, who sat at the Lord's feet and listened to his teaching. But Martha was distracted with much serving. And she went up to him and said, 'Lord, do you not care that my sister has left me to serve alone? Tell her then to help me.' But the Lord answered her, 'Martha, Martha, you are anxious and troubled about many things, but one thing is necessary. Mary has chosen the good portion, which will not be taken away from her.' Now Jesus was praying in a certain place, and when he finished, one of his disciples said to him, 'Lord, teach us to pray, as John taught his disciples.' And he said to them, 'When you pray, say: \"Father, hallowed be your name. Your kingdom come. Give us each day our daily bread, and forgive us our sins, for we ourselves forgive everyone who is indebted to us. And lead us not into temptation.\"' And he said to them, 'Which of you who has a friend will go to him at midnight and say to him, \"Friend, lend me three loaves, for a friend of mine has arrived on a journey, and I have nothing to set before him\"; and he will answer from within, \"Do not bother me; the door is now shut, and my children are with me in bed. I cannot get up and give you anything\"? I tell you, though he will not get up and give him anything because he is his friend, yet because of his impudence he will rise and give him whatever he needs. And I tell you, ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you. For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened. What father among you, if his son asks for a fish, will instead of a fish give him a serpent; or if he asks for an egg, will give him a scorpion? If you then, who are evil, know how to give good gifts to your children, how much more will the heavenly Father give the Holy Spirit to those who ask him!' Now he was casting out a demon that was mute. When the demon had gone out, the mute man spoke, and the people marveled. But some of them said, 'He casts out demons by Beelzebul, the prince of demons,' while others, to test him, kept seeking from him a sign from heaven. But he, knowing their thoughts, said to them, 'Every kingdom divided against itself is laid waste, and a divided household falls. And if Satan also is divided against himself, how will his kingdom stand? For you say that I cast out demons by Beelzebul. And if I cast out demons by Beelzebul, by whom do your sons cast them out? Therefore they will be your judges. But if it is by the finger of God that I cast out demons, then the kingdom of God has come upon you. When a strong man, fully armed, guards his own palace, his goods are safe; but when one stronger than he attacks him and overcomes him, he takes away his armor in which he trusted and divides his spoil. Whoever is not with me is against me, and whoever does not gather with me scatters. When the unclean spirit has gone out of a person, it passes through waterless places seeking rest, and finding none it says, \"I will return to my house from which I came.\" And when it comes, it finds the house swept and put in order. Then it goes and brings seven other spirits more evil than itself, and they enter and dwell there. And the last state of that person is worse than the first.' As he said these things, a woman in the crowd raised her voice and said to him, 'Blessed is the womb that bore you, and the breasts at which you nursed!' But he said, 'Blessed rather are those who hear the word of God and keep it!' When the crowds were increasing, he began to say, 'This generation is an evil generation. It seeks for a sign, but no sign will be given to it except the sign of Jonah. For as Jonah became a sign to the people of Nineveh, so will the Son of Man be to this generation. The queen of the South will rise up at the judgment with the men of this generation and condemn them, for she came from the ends of the earth to hear the wisdom of Solomon, and behold, something greater than Solomon is here. The men of Nineveh will rise up at the judgment with this generation and condemn it, for they repented at the preaching of Jonah, and behold, something greater than Jonah is here.' While Jesus was speaking, a Pharisee asked him to dine with him, so he went in and reclined at table. The Pharisee was astonished to see that he did not first wash before dinner. And the Lord said to him, 'Now you Pharisees cleanse the outside of the cup and of the dish, but inside you are full of greed and wickedness. You fools! Did not he who made the outside make the inside also? But give as alms those things that are within, and behold, everything is clean for you. But woe to you Pharisees! For you tithe mint and rue and every herb, and neglect justice and the love of God. These you ought to have done, without neglecting the others. Woe to you Pharisees! For you love the best seat in the synagogues and greetings in the marketplaces. Woe to you! For you are like unmarked graves, and people walk over them without knowing it.' One of the lawyers answered him, 'Teacher, in saying these things you insult us also.' And he said, 'Woe to you lawyers also! For you load people with burdens hard to bear, and you yourselves do not touch the burdens with one of your fingers. Woe to you! For you build the tombs of the prophets whom your fathers killed. So you are witnesses and you consent to the deeds of your fathers, for they killed them, and you build their tombs. Therefore also the Wisdom of God said, \"I will send them prophets and apostles, some of whom they will kill and persecute,\" so that the blood of all the prophets, shed from the foundation of the world, may be charged against this generation, from the blood of Abel to the blood of Zechariah, who perished between the altar and the sanctuary. Yes, I tell you, it will be required of this generation. Woe to you lawyers! For you have taken away the key of knowledge. You did not enter yourselves, and you hindered those who were entering.' As he went away from there, the scribes and the Pharisees began to press him hard and to provoke him to speak about many things, lying in wait for him, to catch him in something he might say."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus sets His face toward Jerusalem and begins teaching intensively. Today we explore the cost of discipleship, the Good Samaritan, Mary and Martha, the Lord's Prayer, and confrontation with religious leaders."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to key passages from Luke 9 through 11. When the days drew near for him to be taken up, he set his face to go to Jerusalem. Someone said to him, 'I will follow you wherever you go.' And Jesus said, 'Foxes have holes, and birds have nests, but the Son of Man has nowhere to lay his head.' To another he said, 'Follow me.' But he said, 'Let me first bury my father.' Jesus said, 'Leave the dead to bury their own dead. But go and proclaim the kingdom of God.' The Lord appointed seventy-two others and sent them. They returned with joy, saying, 'Lord, even the demons are subject to us!' And he said, 'I saw Satan fall like lightning from heaven. Nevertheless, do not rejoice that spirits are subject to you, but rejoice that your names are written in heaven.' A lawyer said, 'What shall I do to inherit eternal life?' He said, 'Love the Lord your God with all your heart, and your neighbor as yourself.' But desiring to justify himself, he said, 'Who is my neighbor?' Jesus replied, 'A man was going down from Jerusalem to Jericho, and fell among robbers. A priest passed by on the other side. So likewise a Levite. But a Samaritan had compassion. He bound up his wounds and took care of him. Which proved to be a neighbor?' He said, 'The one who showed mercy.' And Jesus said, 'You go, and do likewise.' Martha welcomed him into her house. Mary sat at the Lord's feet and listened. But Martha was distracted with serving. The Lord answered, 'Martha, you are anxious about many things, but one thing is necessary. Mary has chosen the good portion.' One of his disciples said, 'Lord, teach us to pray.' And he said, 'When you pray, say: Father, hallowed be your name. Your kingdom come. Give us each day our daily bread, and forgive us our sins, for we ourselves forgive everyone. And lead us not into temptation. Ask, and it will be given you; seek, and you will find; knock, and it will be opened. How much more will the heavenly Father give the Holy Spirit to those who ask him!' He said to the Pharisees, 'Woe to you! For you tithe mint and rue and every herb, and neglect justice and the love of God. You are like unmarked graves.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus resolves to go to Jerusalem despite rejection. He demands total commitment from would-be followers. The seventy-two return victoriously. A lawyer tests Jesus with questions about eternal life. Martha worries while Mary sits at Jesus' feet. Disciples ask for prayer instruction. Pharisees accuse Jesus of demonic power, but He proves His authority."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Following Jesus requires abandoning security and earthly ties. The Good Samaritan redefines neighbor as anyone in need, regardless of ethnicity or religion. Compassionate action proves love. Mary models choosing better over busy. The Lord's Prayer is simple, communal, dependent. God gives the Holy Spirit to those who ask. Jesus exposes Pharisees' external religion hiding internal corruption."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include costly discipleship, universal neighbor-love across boundaries, active compassion over religious status, choosing devotion over distraction, persistent prayer, the Father's generosity in giving the Spirit, Jesus' authority over demons, spiritual warfare, and judgment on religious hypocrisy that burdens people while neglecting justice and love."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: What excuses keep you from full commitment to Jesus? Who is your neighbor that you're avoiding? Are you more like Mary or Martha? How does the Lord's Prayer shape your praying? What external religion might hide internal corruption?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus journeys to Jerusalem teaching radical discipleship, compassionate neighbor-love, devotional priority, and persistent prayer. He confronts religious hypocrisy. Next, more teaching on discipleship. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "9:51-11:54",
    "theological_themes": ["discipleship", "neighbor_love", "compassion", "prayer", "holy_spirit", "spiritual_warfare", "religious_hypocrisy"],
    "time_period": "circa_29_ad",
    "canonical_order": 42
  }
}
