{
  "lesson_id": "ntf03_lesson_07",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 7,
  "title": "Sent to Proclaim",
  "objective": "See Jesus send out the Twelve and feed five thousand, revealing His provision and identity.",
  "duration": "8 minutes",
  "prerequisite": "ntf03_lesson_06",
  "required_passages": [
    {
      "passage_id": "luk_9_1_50",
      "reference": "Luke 9:1-50",
      "text": "And he called the twelve together and gave them power and authority over all demons and to cure diseases, and he sent them out to proclaim the kingdom of God and to heal. And he said to them, 'Take nothing for your journey, no staff, nor bag, nor bread, nor money; and do not have two tunics. And whatever house you enter, stay there, and from there depart. And wherever they do not receive you, when you leave that town shake off the dust from your feet as a testimony against them.' And they departed and went through the villages, preaching the gospel and healing everywhere. Now Herod the tetrarch heard about all that was happening, and he was perplexed, because it was said by some that John had been raised from the dead, by some that Elijah had appeared, and by others that one of the prophets of old had risen. Herod said, 'John I beheaded, but who is this about whom I hear such things?' And he sought to see him. On their return the apostles told him all that they had done. And he took them and withdrew apart to a town called Bethsaida. When the crowds learned it, they followed him, and he welcomed them and spoke to them of the kingdom of God and cured those who had need of healing. Now the day began to wear away, and the twelve came and said to him, 'Send the crowd away to go into the surrounding villages and countryside to find lodging and get provisions, for we are here in a desolate place.' But he said to them, 'You give them something to eat.' They said, 'We have no more than five loaves and two fish—unless we are to go and buy food for all these people.' For there were about five thousand men. And he said to his disciples, 'Have them sit down in groups of about fifty each.' And they did so, and had them all sit down. And taking the five loaves and the two fish, he looked up to heaven and said a blessing over them. Then he broke the loaves and gave them to the disciples to set before the crowd. And they all ate and were satisfied. And what was left over was picked up, twelve baskets of broken pieces. Now it happened that as he was praying alone, the disciples were with him. And he asked them, 'Who do the crowds say that I am?' And they answered, 'John the Baptist. But others say, Elijah, and others, that one of the prophets of old has risen.' Then he said to them, 'But who do you say that I am?' And Peter answered, 'The Christ of God.' And he strictly charged and commanded them to tell this to no one, saying, 'The Son of Man must suffer many things and be rejected by the elders and chief priests and scribes, and be killed, and on the third day be raised.' And he said to all, 'If anyone would come after me, let him deny himself and take up his cross daily and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake will save it. For what does it profit a man if he gains the whole world and loses or forfeits himself? For whoever is ashamed of me and of my words, of him will the Son of Man be ashamed when he comes in his glory and the glory of the Father and of the holy angels. But I tell you truly, there are some standing here who will not taste death until they see the kingdom of God.' Now about eight days after these sayings he took with him Peter and John and James and went up on the mountain to pray. And as he was praying, the appearance of his face was altered, and his clothing became dazzling white. And behold, two men were talking with him, Moses and Elijah, who appeared in glory and spoke of his departure, which he was about to accomplish at Jerusalem. Now Peter and those who were with him were heavy with sleep, but when they became fully awake they saw his glory and the two men who stood with him. And as the men were parting from him, Peter said to Jesus, 'Master, it is good that we are here. Let us make three tents, one for you and one for Moses and one for Elijah'—not knowing what he said. As he was saying these things, a cloud came and overshadowed them, and they were afraid as they entered the cloud. And a voice came out of the cloud, saying, 'This is my Son, my Chosen One; listen to him!' And when the voice had spoken, Jesus was found alone. And they kept silent and told no one in those days anything of what they had seen. On the next day, when they had come down from the mountain, a great crowd met him. And behold, a man from the crowd cried out, 'Teacher, I beg you to look at my son, for he is my only child. And behold, a spirit seizes him, and he suddenly cries out. It convulses him so that he foams at the mouth, and shatters him, and will hardly leave him. And I begged your disciples to cast it out, but they could not.' Jesus answered, 'O faithless and twisted generation, how long am I to be with you and bear with you? Bring your son here.' While he was coming, the demon threw him to the ground and convulsed him. But Jesus rebuked the unclean spirit and healed the boy and gave him back to his father. And all were astonished at the majesty of God. But while they were all marveling at everything he was doing, Jesus said to his disciples, 'Let these words sink into your ears: The Son of Man is about to be delivered into the hands of men.' But they did not understand this saying, and it was concealed from them, so that they might not perceive it. And they were afraid to ask him about this saying. An argument arose among them as to which of them was the greatest. But Jesus, knowing the reasoning of their hearts, took a child and put him by his side and said to them, 'Whoever receives this child in my name receives me, and whoever receives me receives him who sent me. For he who is least among you all is the one who is great.' John answered, 'Master, we saw someone casting out demons in your name, and we tried to stop him, because he does not follow with us.' But Jesus said to him, 'Do not stop him, for the one who is not against you is for you.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus commissions the Twelve, feeds five thousand, and reveals His identity as Messiah. Today we explore His mission, Peter's confession, transfiguration, and teaching on true greatness through humble service."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Luke chapter 9. He called the twelve together and gave them power and authority over all demons and to cure diseases, and he sent them out to proclaim the kingdom of God and to heal. And he said to them, 'Take nothing for your journey.' And they departed, preaching the gospel and healing everywhere. On their return he took them and withdrew to Bethsaida. When the crowds followed, he welcomed them and spoke of the kingdom of God. The day began to wear away, and the twelve said, 'Send the crowd away to get provisions.' But he said to them, 'You give them something to eat.' They said, 'We have no more than five loaves and two fish.' For there were about five thousand men. And taking the loaves and fish, he looked up to heaven and said a blessing. Then he broke the loaves and gave them to the disciples. And they all ate and were satisfied. As he was praying, he asked them, 'Who do the crowds say that I am?' And they answered, 'John the Baptist, or Elijah, or a prophet.' Then he said, 'But who do you say that I am?' And Peter answered, 'The Christ of God.' And he said, 'The Son of Man must suffer many things and be rejected and be killed, and on the third day be raised. If anyone would come after me, let him deny himself and take up his cross daily and follow me.' About eight days later he took Peter and John and James up on the mountain to pray. And as he was praying, his appearance was altered, and his clothing became dazzling white. And behold, Moses and Elijah appeared in glory and spoke of his departure. And a voice came out of the cloud, saying, 'This is my Son, my Chosen One; listen to him!' A man from the crowd cried, 'Teacher, I beg you to look at my son, for he is my only child. I begged your disciples to cast out the spirit, but they could not.' Jesus rebuked the unclean spirit and healed the boy. An argument arose among them as to which was the greatest. But Jesus took a child and said, 'Whoever receives this child in my name receives me. For he who is least among you all is the one who is great.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus sends the Twelve with His authority to proclaim and heal. He miraculously feeds thousands. Peter confesses Jesus as Messiah, but Jesus predicts suffering. The transfiguration reveals His glory and confirms His mission. Descending, He heals a boy the disciples couldn't help. The disciples argue about greatness, revealing their misunderstanding."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The commissioning demonstrates Jesus sharing His authority. The feeding miracle shows divine provision and points to Jesus as the bread of life. Peter's confession is crucial, but immediately Jesus redefines messiahship through suffering. The transfiguration previews glory and links Jesus to Law and Prophets. True greatness comes through humble service, not status-seeking."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include apostolic mission, Jesus' divine provision, messianic identity, the necessity of the cross, daily self-denial, transfiguration revealing glory, Moses and Elijah testifying to Jesus, failure through unbelief, and greatness through serving the least. Luke emphasizes prayer before major events."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: What does it mean to take up your cross daily? Why does Jesus predict suffering immediately after Peter's confession? What does the transfiguration reveal about Jesus' true identity? How does receiving a child demonstrate greatness?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus sends disciples with His authority, miraculously provides, and reveals His identity as suffering Messiah. True greatness comes through humble service. Next, we journey toward Jerusalem. Well done."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "9:1-50",
    "theological_themes": ["mission", "provision", "messianic_identity", "suffering_messiah", "transfiguration", "humility", "servanthood"],
    "time_period": "circa_29_ad",
    "canonical_order": 42
  }
}
