{
  "lesson_id": "ntf03_lesson_04",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 4,
  "title": "Called to Follow",
  "objective": "Discover how Jesus calls disciples and teaches radical kingdom ethics in the Sermon on the Plain.",
  "duration": "9 minutes",
  "prerequisite": "ntf03_lesson_03",
  "required_passages": [
    {
      "passage_id": "luk_5_1_6_49",
      "reference": "Luke 5:1-6:49",
      "text": "On one occasion, while the crowd was pressing in on him to hear the word of God, he was standing by the lake of Gennesaret, and he saw two boats by the lake, but the fishermen had gone out of them and were washing their nets. Getting into one of the boats, which was Simon's, he asked him to put out a little from the land. And he sat down and taught the people from the boat. And when he had finished speaking, he said to Simon, 'Put out into the deep and let down your nets for a catch.' And Simon answered, 'Master, we toiled all night and took nothing! But at your word I will let down the nets.' And when they had done this, they enclosed a large number of fish, and their nets were breaking. They signaled to their partners in the other boat to come and help them. And they came and filled both the boats, so that they began to sink. But when Simon Peter saw it, he fell down at Jesus' knees, saying, 'Depart from me, for I am a sinful man, O Lord.' For he and all who were with him were astonished at the catch of fish that they had taken, and so also were James and John, sons of Zebedee, who were partners with Simon. And Jesus said to Simon, 'Do not be afraid; from now on you will be catching men.' And when they had brought their boats to land, they left everything and followed him. While he was in one of the cities, there came a man full of leprosy. And when he saw Jesus, he fell on his face and begged him, 'Lord, if you will, you can make me clean.' And Jesus stretched out his hand and touched him, saying, 'I will; be clean.' And immediately the leprosy left him. On one of those days, as he was teaching, Pharisees and teachers of the law were sitting there, who had come from every village of Galilee and Judea and from Jerusalem. And the power of the Lord was with him to heal. And behold, some men were bringing on a bed a man who was paralyzed, and they were seeking to bring him in and lay him before Jesus, but finding no way to bring him in, because of the crowd, they went up on the roof and let him down with his bed through the tiles into the midst before Jesus. And when he saw their faith, he said, 'Man, your sins are forgiven you.' And the scribes and the Pharisees began to question, saying, 'Who is this who speaks blasphemies? Who can forgive sins but God alone?' When Jesus perceived their thoughts, he answered them, 'Why do you question in your hearts? Which is easier, to say, \"Your sins are forgiven you,\" or to say, \"Rise and walk\"? But that you may know that the Son of Man has authority on earth to forgive sins'—he said to the man who was paralyzed—'I say to you, rise, pick up your bed and go home.' And immediately he rose up before them and picked up what he had been lying on and went home, glorifying God. After this he went out and saw a tax collector named Levi, sitting at the tax booth. And he said to him, 'Follow me.' And leaving everything, he rose and followed him. And Levi made him a great feast in his house, and there was a large company of tax collectors and others reclining at table with them. And the Pharisees and their scribes grumbled at his disciples, saying, 'Why do you eat and drink with tax collectors and sinners?' And Jesus answered them, 'Those who are well have no need of a physician, but those who are sick. I have not come to call the righteous but sinners to repentance.' In those days he went out to the mountain to pray, and all night he continued in prayer to God. And when day came, he called his disciples and chose from them twelve, whom he named apostles: Simon, whom he named Peter, and Andrew his brother, and James and John, and Philip, and Bartholomew, and Matthew, and Thomas, and James the son of Alphaeus, and Simon who was called the Zealot, and Judas the son of James, and Judas Iscariot, who became a traitor. And he came down with them and stood on a level place, with a great crowd of his disciples and a great multitude of people from all Judea and Jerusalem and the seacoast of Tyre and Sidon, who came to hear him and to be healed of their diseases. And those who were troubled with unclean spirits were cured. And all the crowd sought to touch him, for power came out from him and healed them all. And he lifted up his eyes on his disciples, and said: 'Blessed are you who are poor, for yours is the kingdom of God. Blessed are you who are hungry now, for you shall be satisfied. Blessed are you who weep now, for you shall laugh. Blessed are you when people hate you and when they exclude you and revile you and spurn your name as evil, on account of the Son of Man! Rejoice in that day, and leap for joy, for behold, your reward is great in heaven; for so their fathers did to the prophets. But woe to you who are rich, for you have received your consolation. Woe to you who are full now, for you shall be hungry. Woe to you who laugh now, for you shall mourn and weep. Woe to you, when all people speak well of you, for so their fathers did to the false prophets. But I say to you who hear, Love your enemies, do good to those who hate you, bless those who curse you, pray for those who abuse you. To one who strikes you on the cheek, offer the other also, and from one who takes away your cloak do not withhold your tunic either. Give to everyone who begs from you, and from one who takes away your goods do not demand them back. And as you wish that others would do to you, do so to them. If you love those who love you, what benefit is that to you? For even sinners love those who love them. And if you do good to those who do good to you, what benefit is that to you? For even sinners do the same. And if you lend to those from whom you expect to receive, what credit is that to you? Even sinners lend to sinners, to get back the same amount. But love your enemies, and do good, and lend, expecting nothing in return, and your reward will be great, and you will be sons of the Most High, for he is kind to the ungrateful and the evil. Be merciful, even as your Father is merciful. Judge not, and you will not be judged; condemn not, and you will not be condemned; forgive, and you will be forgiven; give, and it will be given to you. Good measure, pressed down, shaken together, running over, will be put into your lap. For with the measure you use it will be measured back to you.' He also told them a parable: 'Can a blind man lead a blind man? Will they not both fall into a pit? A disciple is not above his teacher, but everyone when he is fully trained will be like his teacher. Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye? How can you say to your brother, \"Brother, let me take out the speck that is in your eye,\" when you yourself do not see the log that is in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take out the speck that is in your brother's eye. For no good tree bears bad fruit, nor again does a bad tree bear good fruit, for each tree is known by its own fruit. For figs are not gathered from thornbushes, nor are grapes picked from a bramble bush. The good person out of the good treasure of his heart produces good, and the evil person out of his evil treasure produces evil, for out of the abundance of the heart his mouth speaks. Why do you call me \"Lord, Lord,\" and not do what I tell you? Everyone who comes to me and hears my words and does them, I will show you what he is like: he is like a man building a house, who dug deep and laid the foundation on the rock. And when a flood arose, the stream broke against that house and could not shake it, because it had been well built. But the one who hears and does not do them is like a man who built a house on the ground without a foundation. When the stream broke against it, immediately it fell, and the ruin of that house was great.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus calls fishermen and a tax collector to follow Him. After choosing the Twelve, He teaches kingdom ethics that overturn worldly values. Today we explore radical discipleship and love for enemies."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to key passages from Luke 5 and 6. He was standing by the lake, and he saw two boats. He said to Simon, 'Put out into the deep and let down your nets for a catch.' And Simon answered, 'Master, we toiled all night and took nothing! But at your word I will let down the nets.' And when they had done this, they enclosed a large number of fish. Peter fell down at Jesus' knees, saying, 'Depart from me, for I am a sinful man, O Lord.' And Jesus said to Simon, 'Do not be afraid; from now on you will be catching men.' And when they had brought their boats to land, they left everything and followed him. Some men were bringing a man who was paralyzed before Jesus. And when he saw their faith, he said, 'Man, your sins are forgiven you.' And the scribes and Pharisees said, 'Who can forgive sins but God alone?' But Jesus said to the paralyzed man, 'Rise, pick up your bed and go home.' He went out and saw a tax collector named Levi. And he said to him, 'Follow me.' And leaving everything, he rose and followed him. He went out to the mountain to pray, and all night he continued in prayer to God. And when day came, he called his disciples and chose from them twelve, whom he named apostles. And he lifted up his eyes on his disciples, and said: 'Blessed are you who are poor, for yours is the kingdom of God. Blessed are you who are hungry now, for you shall be satisfied. Blessed are you who weep now, for you shall laugh. But woe to you who are rich, for you have received your consolation. But I say to you who hear, Love your enemies, do good to those who hate you, bless those who curse you, pray for those who abuse you. Be merciful, even as your Father is merciful. Judge not, and you will not be judged; forgive, and you will be forgiven. Why do you call me Lord, Lord, and not do what I tell you? Everyone who comes to me and hears my words and does them is like a man building a house on the rock. But the one who hears and does not do them is like a man who built a house without a foundation, and the ruin was great.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus demonstrates authority over nature, disease, and sin. Peter's recognition of his sinfulness shows true repentance. Jesus calls social outcasts like Levi, scandalizing religious leaders. After praying all night, He chooses twelve apostles. His sermon on the plain teaches reversed values and radical love."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The miraculous catch reveals Jesus' authority and Peter's inadequacy. Touching a leper breaks purity laws, showing compassion over ritual. Forgiving the paralytic proves Jesus' divine authority. Levi's immediate obedience models total commitment. The sermon contrasts present poverty with future blessing, demanding enemy love that mirrors the Father's mercy. Obedience proves genuine discipleship."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include radical discipleship requiring leaving everything, Jesus' authority to forgive sins, compassion for outcasts, prayer before major decisions, blessing the poor and persecuted, loving enemies as God does, mercy over judgment, and building life on obedience to Jesus' words. Luke emphasizes Jesus welcoming sinners."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: What does leaving everything to follow Jesus mean today? Why does Jesus link forgiveness and healing? How does loving enemies reflect God's character? What foundation are you building your life on?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus calls disciples to radical following and teaches kingdom values that reverse worldly wisdom. Love for enemies reveals God's mercy. Next, we explore His compassion and authority. Well done."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "5-6",
    "theological_themes": ["discipleship", "authority", "forgiveness", "compassion", "enemy_love", "mercy", "obedience"],
    "time_period": "circa_29_ad",
    "canonical_order": 42
  }
}
