{
  "lesson_id": "ntf03_lesson_05",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 5,
  "title": "Faith and Compassion",
  "objective": "Witness Jesus' compassion for diverse people: a centurion's faith, a widow's son, and a sinful woman's worship.",
  "duration": "8 minutes",
  "prerequisite": "ntf03_lesson_04",
  "required_passages": [
    {
      "passage_id": "luk_7_1_50",
      "reference": "Luke 7:1-50",
      "text": "After he had finished all his sayings in the hearing of the people, he entered Capernaum. Now a centurion had a servant who was sick and at the point of death, who was highly valued by him. When the centurion heard about Jesus, he sent to him elders of the Jews, asking him to come and heal his servant. And when they came to Jesus, they pleaded with him earnestly, saying, 'He is worthy to have you do this for him, for he loves our nation, and he is the one who built us our synagogue.' And Jesus went with them. When he was not far from the house, the centurion sent friends, saying to him, 'Lord, do not trouble yourself, for I am not worthy to have you come under my roof. Therefore I did not presume to come to you. But say the word, and let my servant be healed. For I too am a man set under authority, with soldiers under me: and I say to one, \"Go,\" and he goes; and to another, \"Come,\" and he comes; and to my servant, \"Do this,\" and he does it.' When Jesus heard these things, he marveled at him, and turning to the crowd that followed him, said, 'I tell you, not even in Israel have I found such faith.' And when those who had been sent returned to the house, they found the servant well. Soon afterward he went to a town called Nain, and his disciples and a great crowd went with him. As he drew near to the gate of the town, behold, a man who had died was being carried out, the only son of his mother, and she was a widow, and a considerable crowd from the town was with her. And when the Lord saw her, he had compassion on her and said to her, 'Do not weep.' Then he came up and touched the bier, and the bearers stood still. And he said, 'Young man, I say to you, arise.' And the dead man sat up and began to speak, and Jesus gave him to his mother. Fear seized them all, and they glorified God, saying, 'A great prophet has arisen among us!' and 'God has visited his people!' And this report about him spread through the whole of Judea and all the surrounding country. The disciples of John reported all these things to him. And John, calling two of his disciples to him, sent them to the Lord, saying, 'Are you the one who is to come, or shall we look for another?' And when the men had come to him, they said, 'John the Baptist has sent us to you, saying, \"Are you the one who is to come, or shall we look for another?\"' In that hour he healed many people of diseases and plagues and evil spirits, and on many who were blind he bestowed sight. And he answered them, 'Go and tell John what you have seen and heard: the blind receive their sight, the lame walk, lepers are cleansed, and the deaf hear, the dead are raised up, the poor have good news preached to them. And blessed is the one who is not offended by me.' When John's messengers had gone, Jesus began to speak to the crowds concerning John: 'What did you go out into the wilderness to see? A reed shaken by the wind? What then did you go out to see? A man dressed in soft clothing? Behold, those who are dressed in splendid clothing and live in luxury are in kings' courts. What then did you go out to see? A prophet? Yes, I tell you, and more than a prophet. This is he of whom it is written, \"Behold, I send my messenger before your face, who will prepare your way before you.\" I tell you, among those born of women none is greater than John. Yet the one who is least in the kingdom of God is greater than he.' One of the Pharisees asked him to eat with him, and he went into the Pharisee's house and reclined at table. And behold, a woman of the city, who was a sinner, when she learned that he was reclining at table in the Pharisee's house, brought an alabaster flask of ointment, and standing behind him at his feet, weeping, she began to wet his feet with her tears and wiped them with the hair of her head and kissed his feet and anointed them with the ointment. Now when the Pharisee who had invited him saw this, he said to himself, 'If this man were a prophet, he would have known who and what sort of woman this is who is touching him, for she is a sinner.' And Jesus answering said to him, 'Simon, I have something to say to you.' And he answered, 'Say it, Teacher.' 'A certain moneylender had two debtors. One owed five hundred denarii, and the other fifty. When they could not pay, he canceled the debt of both. Now which of them will love him more?' Simon answered, 'The one, I suppose, for whom he canceled the larger debt.' And he said to him, 'You have judged rightly.' Then turning toward the woman he said to Simon, 'Do you see this woman? I entered your house; you gave me no water for my feet, but she has wet my feet with her tears and wiped them with her hair. You gave me no kiss, but from the time I came in she has not ceased to kiss my feet. You did not anoint my head with oil, but she has anointed my feet with ointment. Therefore I tell you, her sins, which are many, are forgiven—for she loved much. But he who is forgiven little, loves little.' And he said to her, 'Your sins are forgiven.' Then those who were at table with him began to say among themselves, 'Who is this, who even forgives sins?' And he said to the woman, 'Your faith has saved you; go in peace.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus demonstrates extraordinary compassion across social boundaries. Today we see Him honor a Gentile's faith, raise a widow's son, affirm John the Baptist, and forgive a sinful woman whose love reflects deep gratitude."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Luke chapter 7. A centurion had a servant who was sick. When the centurion heard about Jesus, he sent elders of the Jews to him. The centurion sent friends, saying, 'Lord, I am not worthy to have you come under my roof. But say the word, and let my servant be healed. For I too am a man set under authority.' When Jesus heard these things, he marveled and said, 'I tell you, not even in Israel have I found such faith.' And they found the servant well. Soon afterward he went to a town called Nain, and a man who had died was being carried out, the only son of his mother, and she was a widow. And when the Lord saw her, he had compassion on her and said, 'Do not weep.' Then he touched the bier and said, 'Young man, I say to you, arise.' And the dead man sat up and began to speak, and Jesus gave him to his mother. They glorified God, saying, 'A great prophet has arisen among us!' John sent disciples to Jesus, saying, 'Are you the one who is to come?' And Jesus answered, 'Go and tell John what you have seen: the blind receive their sight, the lame walk, lepers are cleansed, the deaf hear, the dead are raised up, the poor have good news preached to them.' A woman of the city, who was a sinner, brought an alabaster flask of ointment, and weeping, she began to wet his feet with her tears and wiped them with her hair and anointed them. The Pharisee said, 'If this man were a prophet, he would have known she is a sinner.' And Jesus said to him, 'A certain moneylender had two debtors. One owed five hundred denarii, and the other fifty. He canceled the debt of both. Now which will love him more?' Simon answered, 'The one for whom he canceled the larger debt.' And Jesus said, 'Do you see this woman? She has wet my feet with her tears. Therefore I tell you, her sins, which are many, are forgiven—for she loved much. Your faith has saved you; go in peace.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "A Roman centurion shows remarkable faith, trusting Jesus' word alone. At Nain, Jesus encounters a funeral procession for a widow's only son. John questions from prison whether Jesus is Messiah. A notorious sinner worships Jesus extravagantly while a Pharisee judges coldly."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The centurion grasps Jesus' authority, amazingly rare faith for a Gentile. Jesus initiates the Nain miracle, moved by compassion for the widow's loss. To John's doubt, He points to messianic signs from Isaiah. The sinful woman's tears, hair, and ointment express repentant love, contrasting Simon's self-righteousness. Great forgiveness produces great love."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include faith transcending ethnic boundaries, Jesus' authority over death, compassion for the vulnerable, messianic fulfillment, forgiveness for notorious sinners, worship flowing from gratitude, self-righteousness versus broken humility, and salvation through faith. Luke emphasizes Jesus welcoming outcasts others despise."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: What makes the centurion's faith remarkable? How does raising the widow's son reveal Jesus' identity? Why does forgiveness produce love rather than the reverse? How does your love reflect your sense of forgiveness?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus shows compassion that crosses boundaries of ethnicity, ritual purity, and moral reputation. Those who know their need love Him most. Next, we explore parables of the kingdom. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "7",
    "theological_themes": ["faith", "compassion", "resurrection", "forgiveness", "worship", "gratitude", "outcasts"],
    "time_period": "circa_29_ad",
    "canonical_order": 42
  }
}
