{
  "lesson_id": "ntf03_lesson_13",
  "course_id": "new_testament_foundations_03_luke",
  "sequence": 13,
  "title": "Teaching in the Temple",
  "objective": "Explore Jesus' teaching and confrontations in the temple before His passion.",
  "duration": "9 minutes",
  "prerequisite": "ntf03_lesson_12",
  "required_passages": [
    {
      "passage_id": "luk_20_1_21_38",
      "reference": "Luke 20:1-21:38",
      "text": "One day, as Jesus was teaching the people in the temple and preaching the gospel, the chief priests and the scribes with the elders came up and said to him, 'Tell us by what authority you do these things, or who it is that gave you this authority.' He answered them, 'I also will ask you a question. Now tell me, was the baptism of John from heaven or from man?' And they discussed it with one another, saying, 'If we say, \"From heaven,\" he will say, \"Why did you not believe him?\" But if we say, \"From man,\" all the people will stone us to death, for they are convinced that John was a prophet.' So they answered that they did not know where it came from. And Jesus said to them, 'Neither will I tell you by what authority I do these things.' And he began to tell the people this parable: 'A man planted a vineyard and let it out to tenants and went into another country for a long while. When the time came, he sent a servant to the tenants, so that they would give him some of the fruit of the vineyard. But the tenants beat him and sent him away empty-handed. And he sent another servant. But they also beat and treated him shamefully, and sent him away empty-handed. And he sent yet a third. This one also they wounded and cast out. Then the owner of the vineyard said, \"What shall I do? I will send my beloved son; perhaps they will respect him.\" But when the tenants saw him, they said to themselves, \"This is the heir. Let us kill him, so that the inheritance may be ours.\" And they threw him out of the vineyard and killed him. What then will the owner of the vineyard do to them? He will come and destroy those tenants and give the vineyard to others.' When they heard this, they said, 'Surely not!' But he looked directly at them and said, 'What then is this that is written: \"The stone that the builders rejected has become the cornerstone\"? Everyone who falls on that stone will be broken to pieces, and when it falls on anyone, it will crush him.' The scribes and the chief priests sought to lay hands on him at that very hour, for they perceived that he had told this parable against them, but they feared the people. So they watched him and sent spies, who pretended to be sincere, that they might catch him in something he said, so as to deliver him up to the authority and jurisdiction of the governor. So they asked him, 'Teacher, we know that you speak and teach rightly, and show no partiality, but truly teach the way of God. Is it lawful for us to give tribute to Caesar, or not?' But he perceived their craftiness, and said to them, 'Show me a denarius. Whose likeness and inscription does it have?' They said, 'Caesar's.' He said to them, 'Then render to Caesar the things that are Caesar's, and to God the things that are God's.' And they were not able in the presence of the people to catch him in what he said, but marveling at his answer they became silent. There came to him some Sadducees, those who deny that there is a resurrection, and they asked him a question, saying, 'Teacher, Moses wrote for us that if a man's brother dies, having a wife but no children, the man must take the widow and raise up offspring for his brother. Now there were seven brothers. The first took a wife, and died without children. And the second and the third took her, and likewise all seven left no children and died. Afterward the woman also died. In the resurrection, therefore, whose wife will the woman be? For the seven had her as wife.' And Jesus said to them, 'The sons of this age marry and are given in marriage, but those who are considered worthy to attain to that age and to the resurrection from the dead neither marry nor are given in marriage, for they cannot die anymore, because they are equal to angels and are sons of God, being sons of the resurrection. But that the dead are raised, even Moses showed, in the passage about the bush, where he calls the Lord the God of Abraham and the God of Isaac and the God of Jacob. Now he is not God of the dead, but of the living, for all live to him.' Then some of the scribes answered, 'Teacher, you have spoken well.' For they no longer dared to ask him any question. But he said to them, 'How can they say that the Christ is David's son? For David himself says in the Book of Psalms, \"The Lord said to my Lord, 'Sit at my right hand, until I make your enemies your footstool.'\" David thus calls him Lord, so how is he his son?' And in the hearing of all the people he said to his disciples, 'Beware of the scribes, who like to walk around in long robes, and love greetings in the marketplaces and the best seats in the synagogues and the places of honor at feasts, who devour widows' houses and for a pretense make long prayers. They will receive the greater condemnation.' Jesus looked up and saw the rich putting their gifts into the offering box, and he saw a poor widow put in two small copper coins. And he said, 'Truly, I tell you, this poor widow has put in more than all of them. For they all contributed out of their abundance, but she out of her poverty put in all she had to live on.' And while some were speaking of the temple, how it was adorned with noble stones and offerings, he said, 'As for these things that you see, the days will come when there will not be left here one stone upon another that will not be thrown down.' And they asked him, 'Teacher, when will these things be, and what will be the sign when these things are about to take place?' And he said, 'See that you are not led astray. For many will come in my name, saying, \"I am he!\" and, \"The time is at hand!\" Do not go after them. And when you hear of wars and tumults, do not be terrified, for these things must first take place, but the end will not be at once.' Then he said to them, 'Nation will rise against nation, and kingdom against kingdom. There will be great earthquakes, and in various places famines and pestilences. And there will be terrors and great signs from heaven. But before all this they will lay their hands on you and persecute you, delivering you up to the synagogues and prisons, and you will be brought before kings and governors for my name's sake. This will be your opportunity to bear witness. Settle it therefore in your minds not to meditate beforehand how to answer, for I will give you a mouth and wisdom, which none of your adversaries will be able to withstand or contradict. You will be delivered up even by parents and brothers and relatives and friends, and some of you they will put to death. You will be hated by all for my name's sake. But not a hair of your head will perish. By your endurance you will gain your lives. But when you see Jerusalem surrounded by armies, then know that its desolation has come near. Then let those who are in Judea flee to the mountains, and let those who are inside the city depart, and let not those who are out in the country enter it, for these are days of vengeance, to fulfill all that is written. Alas for women who are pregnant and for those who are nursing infants in those days! For there will be great distress upon the earth and wrath against this people. They will fall by the edge of the sword and be led captive among all nations, and Jerusalem will be trampled underfoot by the Gentiles, until the times of the Gentiles are fulfilled. And there will be signs in sun and moon and stars, and on the earth distress of nations in perplexity because of the roaring of the sea and the waves, people fainting with fear and with foreboding of what is coming on the world. For the powers of the heavens will be shaken. And then they will see the Son of Man coming in a cloud with power and great glory. Now when these things begin to take place, straighten up and raise your heads, because your redemption is drawing near.' And he told them a parable: 'Look at the fig tree, and all the trees. As soon as they come out in leaf, you see for yourselves and know that the summer is already near. So also, when you see these things taking place, you know that the kingdom of God is near. Truly, I say to you, this generation will not pass away until all has taken place. Heaven and earth will pass away, but my words will not pass away. But watch yourselves lest your hearts be weighed down with dissipation and drunkenness and cares of this life, and that day come upon you suddenly like a trap. For it will come upon all who dwell on the face of the whole earth. But stay awake at all times, praying that you may have strength to escape all these things that are going to take place, and to stand before the Son of Man.' And every day he was teaching in the temple, but at night he went out and lodged on the mount called Olivet. And early in the morning all the people came to him in the temple to hear him."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "In the temple, Jesus faces hostile questions about His authority, taxes, resurrection, and Messiah's identity. He teaches about the widow's offering and warns of Jerusalem's coming destruction. Today we explore His final public teaching."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Luke 20 and 21. The chief priests and scribes said to him, 'Tell us by what authority you do these things.' He answered, 'I also will ask you: was the baptism of John from heaven or from man?' They discussed it and said, 'If we say, From heaven, he will say, Why did you not believe him?' So they answered they did not know. And Jesus said, 'Neither will I tell you by what authority I do these things.' He told a parable: 'A man planted a vineyard and let it out to tenants. When the time came, he sent servants to get fruit. But the tenants beat them. Then the owner said, I will send my beloved son; perhaps they will respect him. But when the tenants saw him, they said, This is the heir. Let us kill him. And they threw him out and killed him. What then will the owner do? He will destroy those tenants and give the vineyard to others. The stone that the builders rejected has become the cornerstone.' The scribes sought to lay hands on him, for they perceived he had told this parable against them. They sent spies who asked, 'Is it lawful to give tribute to Caesar?' He said, 'Show me a denarius. Whose likeness does it have?' They said, 'Caesar's.' He said, 'Then render to Caesar the things that are Caesar's, and to God the things that are God's.' Some Sadducees asked about resurrection. Jesus said, 'Those who attain the resurrection neither marry nor are given in marriage, for they are equal to angels and are sons of God. Now he is not God of the dead, but of the living.' He said, 'Beware of the scribes, who devour widows' houses and for a pretense make long prayers. They will receive the greater condemnation.' He saw a poor widow put in two small copper coins. And he said, 'This poor widow has put in more than all of them. For she out of her poverty put in all she had to live on.' While some spoke of the temple, he said, 'The days will come when there will not be left here one stone upon another.' They asked, 'When will these things be?' He said, 'See that you are not led astray. When you hear of wars, do not be terrified. Nation will rise against nation. There will be earthquakes and famines. They will persecute you. You will be brought before kings for my name's sake. Settle it in your minds not to meditate beforehand how to answer, for I will give you wisdom. When you see Jerusalem surrounded by armies, then know that its desolation has come near. And then they will see the Son of Man coming in a cloud with power and great glory. This generation will not pass away until all has taken place. Heaven and earth will pass away, but my words will not pass away. Stay awake at all times, praying.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Leaders challenge Jesus' authority, but He turns the question back on them. His vineyard parable predicts their rejection and judgment. Spies try to trap Him on paying taxes. Sadducees question resurrection. Jesus exposes scribal hypocrisy. A widow's small gift exceeds the rich. He predicts the temple's destruction and persecution before His return."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Jesus' authority stems from the same source as John's. The vineyard tenants are Israel's leaders rejecting God's messengers and His Son. The rejected stone becomes cornerstone. Caesar gets his coins; God gets full allegiance. Resurrection life transcends earthly marriage. God is God of the living, not dead. The widow's total giving surpasses large gifts from excess. Jerusalem's rejection brings judgment within that generation. Disciples will face persecution but receive divine wisdom. Christ returns with glory."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include Jesus' divine authority, Israel's leaders rejecting the Messiah, judgment on rejection, rendering to Caesar and God, resurrection hope, danger of religious hypocrisy, sacrificial giving from poverty, Jerusalem's coming destruction, persecution of disciples, promise of divine wisdom, Son of Man's glorious return, and urgency of watchfulness and prayer. Luke emphasizes faithfulness amid opposition."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: Do you acknowledge Jesus' authority? Are you giving Caesar and God their due? How does resurrection hope shape your life? What does the widow's offering teach about generosity? Are you prepared for persecution? Are you staying awake and praying?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus confronts hostile leaders, teaches about resurrection and sacrificial giving, and warns of Jerusalem's destruction and His glorious return. Stay faithful and prayerful. Next, the passion narrative. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "luke",
    "chapter_range": "20-21",
    "theological_themes": ["authority", "rejection", "judgment", "resurrection", "sacrificial_giving", "persecution", "second_coming", "watchfulness"],
    "time_period": "circa_30_ad",
    "canonical_order": 42
  }
}
