{
  "lesson_id": "ntf02_lesson_08",
  "course_id": "new_testament_foundations_02_mark",
  "sequence": 8,
  "title": "The Way of the Servant",
  "objective": "Learn Jesus' teaching that greatness in the kingdom comes through serving others, not seeking power or status.",
  "duration": "8 minutes",
  "prerequisite": "ntf02_lesson_07",
  "required_passages": [
    {
      "passage_id": "mar_9_14_10_52",
      "reference": "Mark 9:14-10:52",
      "text": "And when they came to the disciples, they saw a great crowd around them, and scribes arguing with them. And immediately all the crowd, when they saw him, were greatly amazed and ran up to him and greeted him. And he asked them, 'What are you arguing about with them?' And someone from the crowd answered him, 'Teacher, I brought my son to you, for he has a spirit that makes him mute. And wherever it seizes him, it throws him down, and he foams and grinds his teeth and becomes rigid. So I asked your disciples to cast it out, and they were not able.' And he answered them, 'O faithless generation, how long am I to be with you? How long am I to bear with you? Bring him to me.' And they brought the boy to him. And when the spirit saw him, immediately it convulsed the boy, and he fell on the ground and rolled about, foaming at the mouth. And Jesus asked his father, 'How long has this been happening to him?' And he said, 'From childhood. And it has often cast him into fire and into water, to destroy him. But if you can do anything, have compassion on us and help us.' And Jesus said to him, 'If you can! All things are possible for one who believes.' Immediately the father of the child cried out and said, 'I believe; help my unbelief!' And when Jesus saw that a crowd came running together, he rebuked the unclean spirit, saying to it, 'You mute and deaf spirit, I command you, come out of him and never enter him again.' And after crying out and convulsing him terribly, it came out, and the boy was like a corpse, so that most of them said, 'He is dead.' But Jesus took him by the hand and lifted him up, and he arose. And when he had entered the house, his disciples asked him privately, 'Why could we not cast it out?' And he said to them, 'This kind cannot be driven out by anything but prayer.' They went on from there and passed through Galilee. And he was teaching his disciples, saying to them, 'The Son of Man is going to be delivered into the hands of men, and they will kill him. And when he is killed, after three days he will rise.' But they did not understand the saying, and were afraid to ask him. And they came to Capernaum. And when he was in the house he asked them, 'What were you discussing on the way?' But they kept silent, for on the way they had argued with one another about who was the greatest. And he sat down and called the twelve. And he said to them, 'If anyone would be first, he must be last of all and servant of all.' And he took a child and put him in the midst of them, and taking him in his arms, he said to them, 'Whoever receives one such child in my name receives me, and whoever receives me, receives not me but him who sent me.' And they were on the road, going up to Jerusalem, and Jesus was walking ahead of them. And they were amazed, and those who followed were afraid. And taking the twelve again, he began to tell them what was to happen to him, saying, 'See, we are going up to Jerusalem, and the Son of Man will be delivered over to the chief priests and the scribes, and they will condemn him to death and deliver him over to the Gentiles. And they will mock him and spit on him, and flog him and kill him. And after three days he will rise.' And James and John, the sons of Zebedee, came up to him and said to him, 'Teacher, we want you to do for us whatever we ask of you.' And he said to them, 'What do you want me to do for you?' And they said to him, 'Grant us to sit, one at your right hand and one at your left, in your glory.' Jesus said to them, 'You do not know what you are asking. Are you able to drink the cup that I drink, or to be baptized with the baptism with which I am baptized?' And they said to him, 'We are able.' And Jesus said to them, 'The cup that I drink you will drink, and with the baptism with which I am baptized, you will be baptized, but to sit at my right hand or at my left is not mine to grant, but it is for those for whom it has been prepared.' And when the ten heard it, they began to be indignant at James and John. And Jesus called them to him and said to them, 'You know that those who are considered rulers of the Gentiles lord it over them, and their great ones exercise authority over them. But it shall not be so among you. But whoever would be great among you must be your servant, and whoever would be first among you must be slave of all. For even the Son of Man came not to be served but to serve, and to give his life as a ransom for many.' And they came to Jericho. And as he was leaving Jericho with his disciples and a great crowd, Bartimaeus, a blind beggar, the son of Timaeus, was sitting by the roadside. And when he heard that it was Jesus of Nazareth, he began to cry out and say, 'Jesus, Son of David, have mercy on me!' And many rebuked him, telling him to be silent. But he cried out all the more, 'Son of David, have mercy on me!' And Jesus stopped and said, 'Call him.' And they called the blind man, saying to him, 'Take heart. Get up; he is calling you.' And throwing off his cloak, he sprang up and came to Jesus. And Jesus said to him, 'What do you want me to do for you?' And the blind man said to him, 'Rabbi, let me recover my sight.' And Jesus said to him, 'Go your way; your faith has made you well.' And immediately he recovered his sight and followed him on the way."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson eight. As Jesus journeys toward Jerusalem and the cross, He repeatedly teaches that kingdom greatness comes through serving, not ruling. The disciples struggle to understand this upside-down kingdom where the last are first."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Mark chapter 9 verse 14 through chapter 10 verse 52. And when they came to the disciples, they saw a great crowd around them. And someone from the crowd answered him, 'Teacher, I brought my son to you, for he has a spirit that makes him mute. I asked your disciples to cast it out, and they were not able.' And Jesus said to him, 'If you can! All things are possible for one who believes.' Immediately the father of the child cried out and said, 'I believe; help my unbelief!' And Jesus rebuked the unclean spirit, and the boy was like a corpse, so that most of them said, 'He is dead.' But Jesus took him by the hand and lifted him up, and he arose. And he was teaching his disciples, saying to them, 'The Son of Man is going to be delivered into the hands of men, and they will kill him. And when he is killed, after three days he will rise.' And when he was in the house he asked them, 'What were you discussing on the way?' But they kept silent, for on the way they had argued with one another about who was the greatest. And he sat down and called the twelve. And he said to them, 'If anyone would be first, he must be last of all and servant of all.' And he took a child and put him in the midst of them, and said, 'Whoever receives one such child in my name receives me.' And taking the twelve again, he began to tell them what was to happen to him, saying, 'See, we are going up to Jerusalem, and the Son of Man will be delivered over to the chief priests and the scribes, and they will condemn him to death. And they will mock him and spit on him, and flog him and kill him. And after three days he will rise.' And James and John, the sons of Zebedee, came up to him and said, 'Grant us to sit, one at your right hand and one at your left, in your glory.' And Jesus called them to him and said to them, 'You know that those who are considered rulers of the Gentiles lord it over them. But it shall not be so among you. But whoever would be great among you must be your servant, and whoever would be first among you must be slave of all. For even the Son of Man came not to be served but to serve, and to give his life as a ransom for many.' And they came to Jericho. And as he was leaving Jericho with his disciples, Bartimaeus, a blind beggar, was sitting by the roadside. And when he heard that it was Jesus of Nazareth, he began to cry out and say, 'Jesus, Son of David, have mercy on me!' And Jesus said to him, 'What do you want me to do for you?' And the blind man said to him, 'Rabbi, let me recover my sight.' And Jesus said to him, 'Go your way; your faith has made you well.' And immediately he recovered his sight and followed him on the way."
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Between three passion predictions, the disciples argue about greatness and seek positions of honor. Jesus counters with children as models of kingdom reception and servant leadership as the path to greatness. Blind Bartimaeus sees what the disciples miss: Jesus is the Son of David heading to His throne through suffering."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The demon-possessed boy's deliverance requires prayer and faith. The father's cry, 'I believe; help my unbelief,' expresses honest faith struggling with doubt. Jesus' repeated teaching about His death falls on deaf ears as disciples pursue status. He overturns worldly power structures: greatness comes through serving. His ransom saying reveals the cross's purpose: substitutionary death for many."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include servant leadership versus worldly power, the necessity of Jesus' substitutionary death, faith combined with honest doubt, receiving the kingdom like a child, and the cost of following Jesus to Jerusalem. Bartimaeus models faithful following after receiving sight."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: Where do you seek status rather than serving? How does Jesus' model of giving His life as a ransom redefine greatness? What does receiving the kingdom 'like a child' mean in your life?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus teaches that kingdom greatness flows from serving, not ruling. He came to give His life as a ransom for many, the ultimate act of service. Next, we'll enter Jerusalem with Him. Great work today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "mark",
    "chapter_range": "9:14-10:52",
    "theological_themes": ["servant_leadership", "ransom", "discipleship", "humility", "faith", "substitutionary_atonement"],
    "time_period": "circa_29_30_ad",
    "canonical_order": 41
  }
}
