{
  "lesson_id": "ntf02_lesson_07",
  "course_id": "new_testament_foundations_02_mark",
  "sequence": 7,
  "title": "Who Is Jesus? The Great Confession",
  "objective": "Understand the pivotal moment when Peter confesses Jesus as the Christ and Jesus begins teaching about His coming suffering.",
  "duration": "9 minutes",
  "prerequisite": "ntf02_lesson_06",
  "required_passages": [
    {
      "passage_id": "mar_8_22_9_13",
      "reference": "Mark 8:22-9:13",
      "text": "And they came to Bethsaida. And some people brought to him a blind man and begged him to touch him. And he took the blind man by the hand and led him out of the village. And when he had spit on his eyes and laid his hands on him, he asked him, 'Do you see anything?' And he looked up and said, 'I see people, but they look like trees, walking.' Then Jesus laid his hands on his eyes again; and he opened his eyes, his sight was restored, and he saw everything clearly. And he sent him to his home, saying, 'Do not even enter the village.' And Jesus went on with his disciples to the villages of Caesarea Philippi. And on the way he asked his disciples, 'Who do people say that I am?' And they told him, 'John the Baptist; and others say, Elijah; and others, one of the prophets.' And he asked them, 'But who do you say that I am?' Peter answered him, 'You are the Christ.' And he strictly charged them to tell no one about him. And he began to teach them that the Son of Man must suffer many things and be rejected by the elders and the chief priests and the scribes and be killed, and after three days rise again. And he said this plainly. And Peter took him aside and began to rebuke him. But turning and seeing his disciples, he rebuked Peter and said, 'Get behind me, Satan! For you are not setting your mind on the things of God, but on the things of man.' And calling the crowd to him with his disciples, he said to them, 'If anyone would come after me, let him deny himself and take up his cross and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake and the gospel's will save it. For what does it profit a man to gain the whole world and forfeit his soul? For what can a man give in return for his soul? For whoever is ashamed of me and of my words in this adulterous and sinful generation, of him will the Son of Man also be ashamed when he comes in the glory of his Father with the holy angels.' And he said to them, 'Truly, I say to you, there are some standing here who will not taste death until they see the kingdom of God after it has come with power.' And after six days Jesus took with him Peter and James and John, and led them up a high mountain by themselves. And he was transfigured before them, and his clothes became radiant, intensely white, as no one on earth could bleach them. And there appeared to them Elijah with Moses, and they were talking with Jesus. And Peter said to Jesus, 'Rabbi, it is good that we are here. Let us make three tents, one for you and one for Moses and one for Elijah.' For he did not know what to say, for they were terrified. And a cloud overshadowed them, and a voice came out of the cloud, 'This is my beloved Son; listen to him.' And suddenly, looking around, they no longer saw anyone with them but Jesus only. And as they were coming down the mountain, he charged them to tell no one what they had seen, until the Son of Man had risen from the dead. So they kept the matter to themselves, questioning what this rising from the dead might mean. And they asked him, 'Why do the scribes say that first Elijah must come?' And he said to them, 'Elijah does come first to restore all things. And how is it written of the Son of Man that he should suffer many things and be treated with contempt? But I tell you that Elijah has come, and they did to him whatever they pleased, as it is written of him.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson seven, the turning point of Mark's Gospel. Peter confesses Jesus as the Christ, but then rejects the path of suffering. Jesus reveals that true discipleship requires taking up the cross and following Him to glory through death."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Mark chapter 8 verse 22 through chapter 9 verse 13. And they came to Bethsaida. And some people brought to him a blind man. And he took the blind man by the hand and led him out of the village. And when he had spit on his eyes and laid his hands on him, he asked him, 'Do you see anything?' And he looked up and said, 'I see people, but they look like trees, walking.' Then Jesus laid his hands on his eyes again; and he opened his eyes, his sight was restored, and he saw everything clearly. And Jesus went on with his disciples to the villages of Caesarea Philippi. And on the way he asked his disciples, 'Who do people say that I am?' And they told him, 'John the Baptist; and others say, Elijah; and others, one of the prophets.' And he asked them, 'But who do you say that I am?' Peter answered him, 'You are the Christ.' And he strictly charged them to tell no one about him. And he began to teach them that the Son of Man must suffer many things and be rejected by the elders and the chief priests and the scribes and be killed, and after three days rise again. And Peter took him aside and began to rebuke him. But turning and seeing his disciples, he rebuked Peter and said, 'Get behind me, Satan! For you are not setting your mind on the things of God, but on the things of man.' And calling the crowd to him with his disciples, he said to them, 'If anyone would come after me, let him deny himself and take up his cross and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake and the gospel's will save it. For what does it profit a man to gain the whole world and forfeit his soul?' And after six days Jesus took with him Peter and James and John, and led them up a high mountain by themselves. And he was transfigured before them, and his clothes became radiant, intensely white. And there appeared to them Elijah with Moses, and they were talking with Jesus. And a voice came out of the cloud, 'This is my beloved Son; listen to him.' And suddenly, looking around, they no longer saw anyone with them but Jesus only. And as they were coming down the mountain, he charged them to tell no one what they had seen, until the Son of Man had risen from the dead."
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "The two-stage healing of the blind man symbolizes gradual spiritual sight. Peter's confession marks the Gospel's hinge; from here Jesus focuses on teaching about His death. The Transfiguration confirms Jesus' identity and mission, with Moses and Elijah representing Law and Prophets pointing to Him."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Peter rightly identifies Jesus as Messiah but wrongly rejects suffering. Jesus calls this satanic thinking. True discipleship means cross-bearing and self-denial. Saving life means losing it; losing life for Christ means saving it. The Transfiguration shows His glory and the Father's command: 'Listen to Him.' Peter, James, and John witness divine confirmation before the suffering."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Central themes include Jesus as the suffering Messiah, the necessity of the cross for both Jesus and disciples, the cost of following Christ, the glory that comes through suffering, divine confirmation of Jesus' identity, and the call to listen to Him above all voices."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: How do you, like Peter, sometimes want glory without suffering? What cross is Jesus calling you to take up? How does the Transfiguration's glimpse of glory encourage endurance through hardship?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Peter confesses Jesus as Christ, but must learn that Messiahship means suffering. The Transfiguration reveals the glory awaiting beyond the cross. True discipleship follows Jesus through death to life. Next, we'll see His teaching on servanthood. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "advanced",
    "testament": "new",
    "book": "mark",
    "chapter_range": "8:22-9:13",
    "theological_themes": ["christology", "suffering_messiah", "discipleship", "cross_bearing", "transfiguration", "glory"],
    "time_period": "circa_29_ad",
    "canonical_order": 41
  }
}
