{
  "lesson_id": "ntf02_lesson_02",
  "course_id": "new_testament_foundations_02_mark",
  "sequence": 2,
  "title": "Growing Conflict with Religious Leaders",
  "objective": "Understand how Jesus' authority and interpretation of the Law brought Him into escalating conflict with the religious establishment.",
  "duration": "8 minutes",
  "prerequisite": "ntf02_lesson_01",
  "required_passages": [
    {
      "passage_id": "mar_2_1_3_6",
      "reference": "Mark 2:1-3:6",
      "text": "And when he returned to Capernaum after some days, it was reported that he was at home. And many were gathered together, so that there was no more room, not even at the door. And he was preaching the word to them. And they came, bringing to him a paralytic carried by four men. And when they could not get near him because of the crowd, they removed the roof above him, and when they had made an opening, they let down the bed on which the paralytic lay. And when Jesus saw their faith, he said to the paralytic, 'Son, your sins are forgiven.' Now some of the scribes were sitting there, questioning in their hearts, 'Why does this man speak like that? He is blaspheming! Who can forgive sins but God alone?' And immediately Jesus, perceiving in his spirit that they thus questioned within themselves, said to them, 'Why do you question these things in your hearts? Which is easier, to say to the paralytic, Your sins are forgiven, or to say, Rise, take up your bed and walk? But that you may know that the Son of Man has authority on earth to forgive sins'—he said to the paralytic—'I say to you, rise, pick up your bed, and go home.' And he rose and immediately picked up his bed and went out before them all, so that they were all amazed and glorified God, saying, 'We never saw anything like this!' He went out again beside the sea, and all the crowd was coming to him, and he was teaching them. And as he passed by, he saw Levi the son of Alphaeus sitting at the tax booth, and he said to him, 'Follow me.' And he rose and followed him. And as he reclined at table in his house, many tax collectors and sinners were reclining with Jesus and his disciples, for there were many who followed him. And the scribes of the Pharisees, when they saw that he was eating with sinners and tax collectors, said to his disciples, 'Why does he eat with tax collectors and sinners?' And when Jesus heard it, he said to them, 'Those who are well have no need of a physician, but those who are sick. I came not to call the righteous, but sinners.' Now John's disciples and the Pharisees were fasting. And people came and said to him, 'Why do John's disciples and the disciples of the Pharisees fast, but your disciples do not fast?' And Jesus said to them, 'Can the wedding guests fast while the bridegroom is with them? As long as they have the bridegroom with them, they cannot fast. The days will come when the bridegroom is taken away from them, and then they will fast in that day. No one sews a piece of unshrunk cloth on an old garment. If he does, the patch tears away from it, the new from the old, and a worse tear is made. And no one puts new wine into old wineskins. If he does, the wine will burst the skins—and the wine is destroyed, and so are the skins. But new wine is for fresh wineskins.' One Sabbath he was going through the grainfields, and as they made their way, his disciples began to pluck heads of grain. And the Pharisees were saying to him, 'Look, why are they doing what is not lawful on the Sabbath?' And he said to them, 'Have you never read what David did, when he was in need and was hungry, he and those who were with him: how he entered the house of God, in the time of Abiathar the high priest, and ate the bread of the Presence, which it is not lawful for any but the priests to eat, and also gave it to those who were with him?' And he said to them, 'The Sabbath was made for man, not man for the Sabbath. So the Son of Man is lord even of the Sabbath.' Again he entered the synagogue, and a man was there with a withered hand. And they watched Jesus, to see whether he would heal him on the Sabbath, so that they might accuse him. And he said to the man with the withered hand, 'Come here.' And he said to them, 'Is it lawful on the Sabbath to do good or to do harm, to save life or to kill?' But they were silent. And he looked around at them with anger, grieved at their hardness of heart, and said to the man, 'Stretch out your hand.' He stretched it out, and his hand was restored. The Pharisees went out and immediately held counsel with the Herodians against him, how to destroy him."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson two. Jesus' authority challenges religious traditions, sparking controversy. Today we see five conflicts revealing His true mission and the hardness of religious hearts."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Mark chapter 2 verse 1 through chapter 3 verse 6. And when he returned to Capernaum after some days, it was reported that he was at home. And many were gathered together. And they came, bringing to him a paralytic carried by four men. And when they could not get near him because of the crowd, they removed the roof above him, and when they had made an opening, they let down the bed on which the paralytic lay. And when Jesus saw their faith, he said to the paralytic, 'Son, your sins are forgiven.' Now some of the scribes were sitting there, questioning in their hearts, 'Why does this man speak like that? He is blaspheming! Who can forgive sins but God alone?' And immediately Jesus, perceiving in his spirit that they thus questioned within themselves, said to them, 'Why do you question these things in your hearts? Which is easier, to say to the paralytic, Your sins are forgiven, or to say, Rise, take up your bed and walk? But that you may know that the Son of Man has authority on earth to forgive sins'—he said to the paralytic—'I say to you, rise, pick up your bed, and go home.' And he rose and immediately picked up his bed and went out before them all. And as he passed by, he saw Levi the son of Alphaeus sitting at the tax booth, and he said to him, 'Follow me.' And he rose and followed him. And as he reclined at table in his house, many tax collectors and sinners were reclining with Jesus and his disciples. And the scribes of the Pharisees said to his disciples, 'Why does he eat with tax collectors and sinners?' And when Jesus heard it, he said to them, 'Those who are well have no need of a physician, but those who are sick. I came not to call the righteous, but sinners.' And people came and said to him, 'Why do John's disciples and the disciples of the Pharisees fast, but your disciples do not fast?' And Jesus said to them, 'Can the wedding guests fast while the bridegroom is with them? No one sews a piece of unshrunk cloth on an old garment. And no one puts new wine into old wineskins. But new wine is for fresh wineskins.' One Sabbath he was going through the grainfields, and as they made their way, his disciples began to pluck heads of grain. And the Pharisees were saying to him, 'Look, why are they doing what is not lawful on the Sabbath?' And he said to them, 'The Sabbath was made for man, not man for the Sabbath. So the Son of Man is lord even of the Sabbath.' Again he entered the synagogue, and a man was there with a withered hand. And they watched Jesus, to see whether he would heal him on the Sabbath, so that they might accuse him. And he said to them, 'Is it lawful on the Sabbath to do good or to do harm, to save life or to kill?' But they were silent. And he looked around at them with anger, grieved at their hardness of heart, and said to the man, 'Stretch out your hand.' He stretched it out, and his hand was restored. The Pharisees went out and immediately held counsel with the Herodians against him, how to destroy him."
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Mark presents five controversies: forgiveness of sins, eating with sinners, fasting, Sabbath grain-plucking, and Sabbath healing. Each reveals Jesus' authority and mission while exposing religious leaders' hardness. Their opposition escalates from questioning to plotting His death."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Jesus claims divine authority to forgive sins, proving it through healing. He fellowships with outcasts, showing His mission to the spiritually sick. The bridegroom imagery reveals His identity. New wine requires new wineskins; His message can't fit old structures. He declares lordship over the Sabbath, prioritizing mercy over ritual."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Central themes include Jesus' divine authority, mission to sinners not the self-righteous, the newness of His covenant, proper Sabbath observance prioritizing people over rules, and religious hardness of heart. The leaders choose tradition over truth."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: How do religious traditions sometimes become obstacles to mercy and grace? What does Jesus mean by saying He came for the sick, not the well? Are you more like the Pharisees or the paralytic's friends?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus' authority over sin, tradition, and Sabbath reveals His divine mission. Religious leaders harden their hearts, beginning their plot against Him. Next, we'll hear His parables of the kingdom. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "mark",
    "chapter_range": "2:1-3:6",
    "theological_themes": ["forgiveness", "authority", "mission_to_sinners", "sabbath", "religious_opposition"],
    "time_period": "circa_28_ad",
    "canonical_order": 41
  }
}
