{
  "lesson_id": "ntf02_lesson_09",
  "course_id": "new_testament_foundations_02_mark",
  "sequence": 9,
  "title": "Jerusalem Confrontation",
  "objective": "Witness Jesus' triumphal entry, temple cleansing, and confrontations with religious leaders as He claims messianic authority in Jerusalem.",
  "duration": "9 minutes",
  "prerequisite": "ntf02_lesson_08",
  "required_passages": [
    {
      "passage_id": "mar_11_1_13_37",
      "reference": "Mark 11:1-13:37",
      "text": "Now when they drew near to Jerusalem, to Bethphage and Bethany, at the Mount of Olives, Jesus sent two of his disciples and said to them, 'Go into the village in front of you, and immediately as you enter it you will find a colt tied, on which no one has ever sat. Untie it and bring it. If anyone says to you, Why are you doing this? say, The Lord has need of it and will send it back here immediately.' And they went away and found a colt tied at a door outside in the street, and they untied it. And some of those standing there said to them, 'What are you doing, untying the colt?' And they told them what Jesus had said, and they let them go. And they brought the colt to Jesus and threw their cloaks on it, and he sat on it. And many spread their cloaks on the road, and others spread leafy branches that they had cut from the fields. And those who went before and those who followed were shouting, 'Hosanna! Blessed is he who comes in the name of the Lord! Blessed is the coming kingdom of our father David! Hosanna in the highest!' And he entered Jerusalem and went into the temple. And when he had looked around at everything, as it was already late, he went out to Bethany with the twelve. On the following day, when they came from Bethany, he was hungry. And seeing in the distance a fig tree in leaf, he went to see if he could find anything on it. When he came to it, he found nothing but leaves, for it was not the season for figs. And he said to it, 'May no one ever eat fruit from you again.' And his disciples heard it. And they came to Jerusalem. And he entered the temple and began to drive out those who sold and those who bought in the temple, and he overturned the tables of the money-changers and the seats of those who sold pigeons. And he would not allow anyone to carry anything through the temple. And he was teaching them and saying to them, 'Is it not written, My house shall be called a house of prayer for all the nations? But you have made it a den of robbers.' And the chief priests and the scribes heard it and were seeking a way to destroy him, for they feared him, because all the crowd was astonished at his teaching. And as they passed by in the morning, they saw the fig tree withered away to its roots. And Peter remembered and said to him, 'Rabbi, look! The fig tree that you cursed has withered.' And Jesus answered them, 'Have faith in God. Truly, I say to you, whoever says to this mountain, Be taken up and thrown into the sea, and does not doubt in his heart, but believes that what he says will come to pass, it will be done for him. Therefore I tell you, whatever you ask in prayer, believe that you have received it, and it will be yours. And whenever you stand praying, forgive, if you have anything against anyone, so that your Father also who is in heaven may forgive you your trespasses.' And they came again to Jerusalem. And as he was walking in the temple, the chief priests and the scribes and the elders came to him, and they said to him, 'By what authority are you doing these things, or who gave you this authority to do them?' Jesus said to them, 'I will ask you one question; answer me, and I will tell you by what authority I do these things. Was the baptism of John from heaven or from man? Answer me.' And they discussed it with one another, saying, 'If we say, From heaven, he will say, Why then did you not believe him? But shall we say, From man?' — they were afraid of the people, for they all held that John really was a prophet. So they answered Jesus, 'We do not know.' And Jesus said to them, 'Neither will I tell you by what authority I do these things.' And he began to speak to them in parables. And they were seeking to arrest him but feared the people, for they perceived that he had told the parable against them. So they left him and went away. And as he came out of the temple, one of his disciples said to him, 'Look, Teacher, what wonderful stones and what wonderful buildings!' And Jesus said to him, 'Do you see these great buildings? There will not be left here one stone upon another that will not be thrown down.' And as he sat on the Mount of Olives opposite the temple, Peter and James and John and Andrew asked him privately, 'Tell us, when will these things be, and what will be the sign when all these things are about to be accomplished?' And Jesus began to say to them, 'See that no one leads you astray. Many will come in my name, saying, I am he! and they will lead many astray. And when you hear of wars and rumors of wars, do not be alarmed. This must take place, but the end is not yet. For nation will rise against nation, and kingdom against kingdom. There will be earthquakes in various places; there will be famines. These are but the beginning of the birth pains. But be on your guard. For they will deliver you over to councils, and you will be beaten in synagogues, and you will stand before governors and kings for my sake, to bear witness before them. And the gospel must first be proclaimed to all nations. But the one who endures to the end will be saved. But when you see the abomination of desolation standing where he ought not to be (let the reader understand), then let those who are in Judea flee to the mountains. And then they will see the Son of Man coming in clouds with great power and glory. And then he will send out the angels and gather his elect from the four winds, from the ends of the earth to the ends of heaven. Heaven and earth will pass away, but my words will not pass away. But concerning that day or that hour, no one knows, not even the angels in heaven, nor the Son, but only the Father. Be on guard, keep awake. For you do not know when the time will come. Therefore stay awake—for you do not know when the master of the house will come, in the evening, or at midnight, or when the rooster crows, or in the morning—lest he come suddenly and find you asleep. And what I say to you I say to all: Stay awake.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson nine. Jesus enters Jerusalem as King, but not the military conqueror people expected. He cleanses the temple, confronts leaders, and warns of coming judgment and His return. His authority provokes deadly opposition."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to key passages from Mark chapters 11 through 13. Now when they drew near to Jerusalem, Jesus sent two of his disciples and said to them, 'Go into the village and you will find a colt tied, on which no one has ever sat. Untie it and bring it.' And they brought the colt to Jesus and threw their cloaks on it, and he sat on it. And many spread their cloaks on the road. And those who went before and those who followed were shouting, 'Hosanna! Blessed is he who comes in the name of the Lord! Blessed is the coming kingdom of our father David!' And he entered Jerusalem and went into the temple. And he entered the temple and began to drive out those who sold and those who bought in the temple, and he overturned the tables of the money-changers. And he was teaching them and saying, 'Is it not written, My house shall be called a house of prayer for all the nations? But you have made it a den of robbers.' And the chief priests and the scribes heard it and were seeking a way to destroy him. And they came again to Jerusalem. And as he was walking in the temple, the chief priests and the scribes and the elders came to him, and they said to him, 'By what authority are you doing these things?' Jesus said to them, 'I will ask you one question. Was the baptism of John from heaven or from man?' So they answered Jesus, 'We do not know.' And Jesus said to them, 'Neither will I tell you by what authority I do these things.' And as he came out of the temple, one of his disciples said to him, 'Look, Teacher, what wonderful stones and what wonderful buildings!' And Jesus said to him, 'Do you see these great buildings? There will not be left here one stone upon another that will not be thrown down.' And Jesus began to say to them, 'See that no one leads you astray. And when you hear of wars and rumors of wars, do not be alarmed. This must take place, but the end is not yet. But be on your guard. For they will deliver you over to councils, and you will be beaten in synagogues. And the gospel must first be proclaimed to all nations. And then they will see the Son of Man coming in clouds with great power and glory. Heaven and earth will pass away, but my words will not pass away. Therefore stay awake—for you do not know when the master of the house will come. And what I say to you I say to all: Stay awake.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus' entry on a colt fulfills Zechariah's prophecy of a humble king. The temple cleansing declares judgment on corrupt worship. Leaders challenge His authority but can't answer His question about John. The Olivet Discourse warns of Jerusalem's destruction and calls for endurance until His return."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Hosanna means 'save now,' but the crowd misunderstands what salvation Jesus brings. The cursed fig tree symbolizes Israel's fruitless religion. Temple cleansing shows zeal for true worship. Jesus' authority comes from God, validated by John's witness. The discourse reveals tribulation before glory, calling disciples to faithful witness and watchfulness."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include Jesus as the humble Davidic King, judgment on fruitless religion, true worship versus ritual, divine authority challenged by religious powers, persecution of disciples, the gospel to all nations, Christ's return in glory, and the call to watchfulness."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: How does Jesus' entry on a donkey subvert expectations of kingly power? What fruitless religious activity needs cleansing from your life? How does the call to 'stay awake' apply to waiting for Christ's return?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus enters Jerusalem as King to cleanse, confront, and warn. He predicts suffering for His followers and the temple's destruction, but promises His glorious return. Stay awake and faithful. Next, we'll witness His passion. Well done today."
    }
  ],
  "metadata": {
    "difficulty": "advanced",
    "testament": "new",
    "book": "mark",
    "chapter_range": "11:1-13:37",
    "theological_themes": ["triumphal_entry", "temple_cleansing", "authority", "olivet_discourse", "second_coming", "watchfulness"],
    "time_period": "circa_30_33_ad",
    "canonical_order": 41
  }
}
