{
  "lesson_id": "ntf02_lesson_06",
  "course_id": "new_testament_foundations_02_mark",
  "sequence": 6,
  "title": "The Twelve Sent Out and Fed",
  "objective": "Understand Jesus' sending of the disciples with His authority and His compassionate provision through feeding the five thousand.",
  "duration": "8 minutes",
  "prerequisite": "ntf02_lesson_05",
  "required_passages": [
    {
      "passage_id": "mar_6_7_44",
      "reference": "Mark 6:7-44",
      "text": "And he called the twelve and began to send them out two by two, and gave them authority over the unclean spirits. He charged them to take nothing for their journey except a staff—no bread, no bag, no money in their belts—but to wear sandals and not put on two tunics. And he said to them, 'Whenever you enter a house, stay there until you depart from there. And if any place will not receive you and they will not listen to you, when you leave, shake off the dust that is on your feet as a testimony against them.' So they went out and proclaimed that people should repent. And they cast out many demons and anointed with oil many who were sick and healed them. The apostles returned to Jesus and told him all that they had done and taught. And he said to them, 'Come away by yourselves to a desolate place and rest a while.' For many were coming and going, and they had no leisure even to eat. And they went away in the boat to a desolate place by themselves. Now many saw them going and recognized them, and they ran there on foot from all the towns and got there ahead of them. When he went ashore he saw a great crowd, and he had compassion on them, because they were like sheep without a shepherd. And he began to teach them many things. And when it grew late, his disciples came to him and said, 'This is a desolate place, and the hour is now late. Send them away to go into the surrounding countryside and villages and buy themselves something to eat.' But he answered them, 'You give them something to eat.' And they said to him, 'Shall we go and buy two hundred denarii worth of bread and give it to them to eat?' And he said to them, 'How many loaves do you have? Go and see.' And when they had found out, they said, 'Five, and two fish.' Then he commanded them all to sit down in groups on the green grass. So they sat down in groups, by hundreds and by fifties. And taking the five loaves and the two fish, he looked up to heaven and said a blessing and broke the loaves and gave them to the disciples to set before the people. And he divided the two fish among them all. And they all ate and were satisfied. And they took up twelve baskets full of broken pieces and of the fish. And those who ate the loaves were five thousand men."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Welcome to lesson six. Jesus now multiplies His ministry by sending the Twelve with His authority. When they return exhausted, He demonstrates His compassion by miraculously feeding thousands, revealing Himself as the Good Shepherd who provides."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to Mark chapter 6, verses 7 through 44. And he called the twelve and began to send them out two by two, and gave them authority over the unclean spirits. He charged them to take nothing for their journey except a staff—no bread, no bag, no money in their belts. And he said to them, 'Whenever you enter a house, stay there until you depart from there. And if any place will not receive you and they will not listen to you, when you leave, shake off the dust that is on your feet as a testimony against them.' So they went out and proclaimed that people should repent. And they cast out many demons and anointed with oil many who were sick and healed them. The apostles returned to Jesus and told him all that they had done and taught. And he said to them, 'Come away by yourselves to a desolate place and rest a while.' For many were coming and going, and they had no leisure even to eat. And they went away in the boat to a desolate place by themselves. Now many saw them going and recognized them, and they ran there on foot from all the towns and got there ahead of them. When he went ashore he saw a great crowd, and he had compassion on them, because they were like sheep without a shepherd. And he began to teach them many things. And when it grew late, his disciples came to him and said, 'This is a desolate place, and the hour is now late. Send them away to go into the surrounding countryside and villages and buy themselves something to eat.' But he answered them, 'You give them something to eat.' And they said to him, 'Shall we go and buy two hundred denarii worth of bread and give it to them to eat?' And he said to them, 'How many loaves do you have? Go and see.' And when they had found out, they said, 'Five, and two fish.' Then he commanded them all to sit down in groups on the green grass. So they sat down in groups, by hundreds and by fifties. And taking the five loaves and the two fish, he looked up to heaven and said a blessing and broke the loaves and gave them to the disciples to set before the people. And he divided the two fish among them all. And they all ate and were satisfied. And they took up twelve baskets full of broken pieces and of the fish. And those who ate the loaves were five thousand men."
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus sends the Twelve on mission with His authority, teaching them dependence on God and hospitality. They return successful but exhausted. Jesus seeks rest with them but finds crowds. His compassion for shepherdless sheep leads to teaching and miraculous provision echoing God's manna in the wilderness."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The mission requires faith and simplicity, trusting God for provision. Jesus models compassion over convenience, teaching despite weariness. He involves disciples in the miracle, using their five loaves and two fish. The abundant leftovers show God's provision exceeds need. The organized groups suggest order in God's kingdom."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Central themes include delegated authority for mission, dependence on God's provision, Jesus as the compassionate Good Shepherd, miraculous multiplication pointing to divine power, and involving disciples in ministry. The feeding echoes exodus manna, identifying Jesus with Yahweh who provides."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: How does sending disciples out two-by-two model biblical community? What does Jesus' willingness to be interrupted teach about ministry priorities? How does He want to use your small resources for kingdom multiplication?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus sends His disciples with authority and provides abundantly for hungry crowds. He is the Good Shepherd who teaches and feeds His flock. Next, we'll see who people say He is. Excellent work today."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "mark",
    "chapter_range": "6:7-44",
    "theological_themes": ["mission", "authority", "compassion", "provision", "feeding_miracle", "good_shepherd"],
    "time_period": "circa_28_29_ad",
    "canonical_order": 41
  }
}
