{
  "lesson_id": "ntf04_lesson_12",
  "course_id": "new_testament_foundations_04_john",
  "sequence": 12,
  "title": "Finished and Risen",
  "objective": "Trace Jesus' arrest, trial, crucifixion, resurrection, and restoration of Peter, seeing the completed mission of the Son of God.",
  "duration": "10 minutes",
  "prerequisite": "ntf04_lesson_11",
  "required_passages": [
    {
      "passage_id": "joh_18_1_21_25",
      "reference": "John 18:1-21:25",
      "text": "When Jesus had spoken these words, he went out with his disciples across the brook Kidron... Judas... came there with a band of soldiers... Jesus... said to them, 'Whom do you seek?' They answered him, 'Jesus of Nazareth.' Jesus said to them, 'I am he.' ...they drew back and fell to the ground... Simon Peter... drew his sword and struck the high priest's servant... Jesus said to Peter, 'Put your sword into its sheath; shall I not drink the cup that the Father has given me?' ... They led Jesus... first to Annas... then to Caiaphas... Peter denied Jesus three times... They led Jesus from the house of Caiaphas to the governor's headquarters... Pilate said, 'Are you the King of the Jews?' Jesus answered, 'My kingdom is not of this world... For this purpose I was born and for this purpose I have come into the world—to bear witness to the truth.' Pilate said to him, 'What is truth?' ...they cried out, 'Away with him, away with him, crucify him!' ... So they took Jesus, and he went out, bearing his own cross... to the place called The Place of a Skull... There they crucified him... Pilate wrote an inscription and put it on the cross. It read, 'Jesus of Nazareth, the King of the Jews.' ... Jesus said to his mother, 'Woman, behold, your son!' Then he said to the disciple, 'Behold, your mother!' ... After this, Jesus, knowing that all was now finished, said (to fulfill the Scripture), 'I thirst.' ... When Jesus had received the sour wine, he said, 'It is finished,' and he bowed his head and gave up his spirit... one of the soldiers pierced his side with a spear, and at once there came out blood and water... Joseph of Arimathea... and Nicodemus... took the body of Jesus and bound it in linen cloths... and laid him in a new tomb... Now on the first day of the week Mary Magdalene came to the tomb early... and saw that the stone had been taken away... Peter and the other disciple ran to the tomb... they saw the linen cloths... Mary stood weeping... she saw two angels... Jesus said to her, 'Woman, why are you weeping? Whom are you seeking?' ... Jesus said to her, 'Mary.' She turned and said to him... 'Rabboni!' Jesus said... 'Go to my brothers and say to them, I am ascending to my Father and your Father.' ... Jesus came and stood among them and said to them, 'Peace be with you.' ... He showed them his hands and his side... He breathed on them and said, 'Receive the Holy Spirit...' Thomas... was not with them... He said, 'Unless I see... I will never believe.' Eight days later... Jesus said to Thomas, 'Put your finger here... do not disbelieve, but believe.' Thomas answered him, 'My Lord and my God!' Jesus said to him, 'Have you believed because you have seen me? Blessed are those who have not seen and yet have believed.' ... After this Jesus revealed himself again... at the Sea of Tiberias... they caught nothing... Jesus said, 'Cast the net on the right side of the boat,' and they found a great catch... Jesus said, 'Come and have breakfast.' ... When they had finished breakfast, Jesus said to Simon Peter, 'Simon, son of John, do you love me more than these?' He said to him, 'Yes, Lord; you know that I love you.' He said to him, 'Feed my lambs.' ... a second time... 'Tend my sheep.' ... a third time... 'Feed my sheep.' ... 'Follow me.' ... This is the disciple who is bearing witness about these things... and we know that his testimony is true."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "We conclude John with the climactic events of salvation: Jesus' arrest, crucifixion, resurrection, and post-resurrection restoration of Peter."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to John chapters 18 through 21. Jesus was arrested in the garden. When the soldiers came, Jesus said, 'I am he,' and they fell to the ground. Peter struck the servant, but Jesus said, 'Put your sword away. Shall I not drink the cup the Father has given me?' Jesus stood before Pilate and said, 'My kingdom is not of this world... For this purpose I have come into the world—to bear witness to the truth.' The crowd demanded crucifixion. Jesus was crucified at Golgotha. Pilate's inscription read, 'Jesus of Nazareth, the King of the Jews.' On the cross Jesus said, 'It is finished,' and gave up his spirit. His side was pierced, and blood and water came out. Joseph of Arimathea and Nicodemus buried Him in a new tomb. On the first day of the week, Mary Magdalene found the tomb empty. Jesus appeared to her and said, 'Mary.' She recognized Him and announced, 'I have seen the Lord.' Jesus appeared to the disciples and said, 'Peace be with you.' Thomas doubted until Jesus invited him to touch His wounds. Thomas confessed, 'My Lord and my God!' Jesus said, 'Blessed are those who have not seen and yet have believed.' Later at the Sea of Tiberias, Jesus provided a miraculous catch and breakfast. He restored Peter three times: 'Do you love me?... Feed my lambs... Tend my sheep... Feed my sheep... Follow me.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "John uniquely highlights Jesus' sovereign control during arrest and trial, His declaration 'It is finished' on the cross, Mary Magdalene as first witness to the resurrection, Thomas's confession of Jesus as God, and Peter's restoration beside another charcoal fire. The Gospel closes by affirming the reliability of eyewitness testimony."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "Jesus is not a victim; He willingly drinks the Father's cup. His kingdom is true but not worldly. On the cross, 'It is finished' declares complete accomplishment of redemption. The empty tomb and appearances confirm bodily resurrection. Thomas's confession, 'My Lord and my God,' is John's highest explicit statement of Jesus' deity. The blessing on those who believe without seeing speaks directly to future generations. Peter, who denied Jesus three times, is restored three times and recommissioned to shepherd Christ's flock. Grace does not ignore failure; it transforms it into mission."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include Jesus' sovereignty in suffering, fulfilled mission on the cross, substitutionary atonement, bodily resurrection, peace for fearful disciples, faith beyond sight, confession of Jesus as Lord and God, restoration after failure, pastoral calling, and trustworthy apostolic witness."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: Do you trust that Jesus truly finished the work needed for your salvation? Have you confessed Him as 'My Lord and my God'? Where do you need His restoring grace like Peter? How is Jesus calling you now to follow and serve?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus is crucified, risen, and reigning. His work is finished, and His call remains: believe and follow. John is complete—next we continue into Acts and the mission of the early church."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "john",
    "chapter_range": "18-21",
    "theological_themes": ["passion", "it_is_finished", "resurrection", "my_lord_my_god", "faith_without_sight", "restoration_of_peter", "mission", "witness"],
    "time_period": "circa_30_ad",
    "canonical_order": 43
  }
}
