{
  "lesson_id": "ntf04_lesson_02",
  "course_id": "new_testament_foundations_04_john",
  "sequence": 2,
  "title": "Signs of Glory",
  "objective": "Witness Jesus' first sign at Cana and His temple cleansing, revealing His glory and authority.",
  "duration": "8 minutes",
  "prerequisite": "ntf04_lesson_01",
  "required_passages": [
    {
      "passage_id": "joh_2_1_3_21",
      "reference": "John 2:1-3:21",
      "text": "On the third day there was a wedding at Cana in Galilee, and the mother of Jesus was there. Jesus also was invited to the wedding with his disciples. When the wine ran out, the mother of Jesus said to him, 'They have no wine.' And Jesus said to her, 'Woman, what does this have to do with me? My hour has not yet come.' His mother said to the servants, 'Do whatever he tells you.' Now there were six stone water jars there for the Jewish rites of purification, each holding twenty or thirty gallons. Jesus said to the servants, 'Fill the jars with water.' And they filled them up to the brim. And he said to them, 'Now draw some out and take it to the master of the feast.' So they took it. When the master of the feast tasted the water now become wine, and did not know where it came from (though the servants who had drawn the water knew), the master of the feast called the bridegroom and said to him, 'Everyone serves the good wine first, and when people have drunk freely, then the poor wine. But you have kept the good wine until now.' This, the first of his signs, Jesus did at Cana in Galilee, and manifested his glory. And his disciples believed in him. After this he went down to Capernaum, with his mother and his brothers and his disciples, and they stayed there for a few days. The Passover of the Jews was at hand, and Jesus went up to Jerusalem. In the temple he found those who were selling oxen and sheep and pigeons, and the money-changers sitting there. And making a whip of cords, he drove them all out of the temple, with the sheep and oxen. And he poured out the coins of the money-changers and overturned their tables. And he told those who sold the pigeons, 'Take these things away; do not make my Father's house a house of trade.' His disciples remembered that it was written, 'Zeal for your house will consume me.' So the Jews said to him, 'What sign do you show us for doing these things?' Jesus answered them, 'Destroy this temple, and in three days I will raise it up.' The Jews then said, 'It has taken forty-six years to build this temple, and will you raise it up in three days?' But he was speaking about the temple of his body. When therefore he was raised from the dead, his disciples remembered that he had said this, and they believed the Scripture and the word that Jesus had spoken. Now when he was in Jerusalem at the Passover Feast, many believed in his name when they saw the signs that he was doing. But Jesus on his part did not entrust himself to them, because he knew all people and needed no one to bear witness about man, for he himself knew what was in man. Now there was a man of the Pharisees named Nicodemus, a ruler of the Jews. This man came to Jesus by night and said to him, 'Rabbi, we know that you are a teacher come from God, for no one can do these signs that you do unless God is with him.' Jesus answered him, 'Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.' Nicodemus said to him, 'How can a man be born when he is old? Can he enter a second time into his mother's womb and be born?' Jesus answered, 'Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God. That which is born of the flesh is flesh, and that which is born of the Spirit is spirit. Do not marvel that I said to you, \"You must be born again.\" The wind blows where it wishes, and you hear its sound, but you do not know where it comes from or where it goes. So it is with everyone who is born of the Spirit.' Nicodemus said to him, 'How can these things be?' Jesus answered him, 'Are you the teacher of Israel and yet you do not understand these things? Truly, truly, I say to you, we speak of what we know, and bear witness to what we have seen, but you do not receive our testimony. If I have told you earthly things and you do not believe, how can you believe if I tell you heavenly things? No one has ascended into heaven except he who descended from heaven, the Son of Man. And as Moses lifted up the serpent in the wilderness, so must the Son of Man be lifted up, that whoever believes in him may have eternal life. For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life. For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him. Whoever believes in him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God. And this is the judgment: the light has come into the world, and people loved the darkness rather than the light because their works were evil. For everyone who does wicked things hates the light and does not come to the light, lest his works should be exposed. But whoever does what is true comes to the light, so that it may be clearly seen that his works have been carried out in God.'"
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus begins His public ministry with a sign at a wedding and a dramatic temple cleansing. Today we explore His first miracle revealing glory, His confrontation with commerce in the temple, and His nighttime conversation with Nicodemus about being born again."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to John 2 and 3. On the third day there was a wedding at Cana in Galilee. When the wine ran out, the mother of Jesus said to him, 'They have no wine.' And Jesus said, 'My hour has not yet come.' His mother said to the servants, 'Do whatever he tells you.' Now there were six stone water jars there for purification. Jesus said to the servants, 'Fill the jars with water.' And they filled them to the brim. And he said, 'Now draw some out and take it to the master of the feast.' When the master tasted the water now become wine, he said to the bridegroom, 'You have kept the good wine until now.' This, the first of his signs, Jesus did at Cana in Galilee, and manifested his glory. And his disciples believed in him. The Passover was at hand, and Jesus went up to Jerusalem. In the temple he found those selling oxen and sheep and pigeons. And making a whip of cords, he drove them all out of the temple. And he poured out the coins and overturned their tables. He told those who sold pigeons, 'Do not make my Father's house a house of trade.' The Jews said, 'What sign do you show us for doing these things?' Jesus answered, 'Destroy this temple, and in three days I will raise it up.' But he was speaking about the temple of his body. Now there was a man named Nicodemus, a ruler of the Jews. This man came to Jesus by night and said, 'Rabbi, we know that you are a teacher come from God, for no one can do these signs unless God is with him.' Jesus answered him, 'Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.' Nicodemus said, 'How can a man be born when he is old?' Jesus answered, 'Unless one is born of water and the Spirit, he cannot enter the kingdom of God. That which is born of the flesh is flesh, and that which is born of the Spirit is spirit. You must be born again. The wind blows where it wishes. So it is with everyone who is born of the Spirit.' Jesus said, 'As Moses lifted up the serpent in the wilderness, so must the Son of Man be lifted up, that whoever believes in him may have eternal life. For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life. For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him. Whoever believes in him is not condemned, but whoever does not believe is condemned already. And this is the judgment: the light has come into the world, and people loved the darkness rather than the light because their works were evil.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "At Cana, Jesus transforms water into wine, His first sign revealing His glory. In Jerusalem, He cleanses the temple with righteous anger, speaking cryptically of His resurrection. Nicodemus, a religious leader, visits Jesus at night seeking understanding but struggling with the concept of spiritual rebirth."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The Cana miracle demonstrates Jesus' creative power and foreshadows abundant life in the kingdom. His 'hour' refers to His crucifixion and glorification. The temple cleansing shows His authority over worship and points to His body as the true temple. Nicodemus represents those who recognize Jesus' signs but lack spiritual understanding. Being born again is not physical but spiritual—the Spirit's sovereign work. The bronze serpent foreshadows the cross. John 3:16 encapsulates the gospel: God's love, Christ's sacrifice, faith's requirement, eternal life's promise."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include Jesus revealing His glory through signs, the temple as His body pointing to resurrection, the necessity of spiritual rebirth, the Spirit's sovereign work in regeneration, Jesus as the Son of Man lifted up for salvation, God's love motivating the gospel, belief versus unbelief determining destiny, and light versus darkness as moral judgment. John emphasizes faith in Jesus for eternal life."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Consider this: How does the Cana miracle reveal Jesus' glory? What does Jesus cleansing the temple teach about worship? Have you been born again by the Spirit? How does John 3:16 describe God's love and your response? Are you coming to the light or loving darkness?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus manifests His glory through signs, claims authority over the temple, and teaches Nicodemus about new birth. God's love gives His Son so believers have eternal life. Next, we'll see Jesus encounter a Samaritan woman. Well done."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "john",
    "chapter_range": "2-3",
    "theological_themes": ["signs", "glory", "temple", "resurrection", "born_again", "holy_spirit", "john_3_16", "salvation", "belief"],
    "time_period": "circa_27_ad",
    "canonical_order": 43
  }
}
