{
  "lesson_id": "ntf04_lesson_07",
  "course_id": "new_testament_foundations_04_john",
  "sequence": 7,
  "title": "The Good Shepherd",
  "objective": "Discover Jesus healing the man born blind and His teaching as the Door and the Good Shepherd who lays down His life.",
  "duration": "10 minutes",
  "prerequisite": "ntf04_lesson_06",
  "required_passages": [
    {
      "passage_id": "joh_9_1_10_42",
      "reference": "John 9:1-10:42",
      "text": "As he passed by, he saw a man blind from birth. And his disciples asked him, 'Rabbi, who sinned, this man or his parents, that he was born blind?' Jesus answered, 'It was not that this man sinned, or his parents, but that the works of God might be displayed in him. We must work the works of him who sent me while it is day; night is coming, when no one can work. As long as I am in the world, I am the light of the world.' Having said these things, he spit on the ground and made mud with the saliva. Then he anointed the man's eyes with the mud and said to him, 'Go, wash in the pool of Siloam' (which means Sent). So he went and washed and came back seeing. The neighbors and those who had seen him before as a beggar were saying, 'Is this not the man who used to sit and beg?' Some said, 'It is he.' Others said, 'No, but he is like him.' He kept saying, 'I am the man.' So they said to him, 'Then how were your eyes opened?' He answered, 'The man called Jesus made mud and anointed my eyes and said to me, \"Go to Siloam and wash.\" So I went and washed and received my sight.' They said to him, 'Where is he?' He said, 'I do not know.' They brought to the Pharisees the man who had formerly been blind. Now it was a Sabbath day when Jesus made the mud and opened his eyes. So the Pharisees again asked him how he had received his sight. And he said to them, 'He put mud on my eyes, and I washed, and I see.' Some of the Pharisees said, 'This man is not from God, for he does not keep the Sabbath.' But others said, 'How can a man who is a sinner do such signs?' And there was a division among them. So they said again to the blind man, 'What do you say about him, since he has opened your eyes?' He said, 'He is a prophet.' The Jews did not believe that he had been blind and had received his sight, until they called the parents of the man who had received his sight and asked them, 'Is this your son, who you say was born blind? How then does he now see?' His parents answered, 'We know that this is our son and that he was born blind. But how he now sees we do not know, nor do we know who opened his eyes. Ask him; he is of age. He will speak for himself.' (His parents said these things because they feared the Jews, for the Jews had already agreed that if anyone should confess Jesus to be Christ, he was to be put out of the synagogue.) Therefore his parents said, 'He is of age; ask him.' So for the second time they called the man who had been blind and said to him, 'Give glory to God. We know that this man is a sinner.' He answered, 'Whether he is a sinner I do not know. One thing I do know, that though I was blind, now I see.' They said to him, 'What did he do to you? How did he open your eyes?' He answered them, 'I have told you already, and you would not listen. Why do you want to hear it again? Do you also want to become his disciples?' And they reviled him, saying, 'You are his disciple, but we are disciples of Moses. We know that God has spoken to Moses, but as for this man, we do not know where he comes from.' The man answered, 'Why, this is an amazing thing! You do not know where he comes from, and yet he opened my eyes. We know that God does not listen to sinners, but if anyone is a worshiper of God and does his will, God listens to him. Never since the world began has it been heard that anyone opened the eyes of a man born blind. If this man were not from God, he could do nothing.' They answered him, 'You were born in utter sin, and would you teach us?' And they cast him out. Jesus heard that they had cast him out, and having found him he said, 'Do you believe in the Son of Man?' He answered, 'And who is he, sir, that I may believe in him?' Jesus said to him, 'You have seen him, and it is he who is speaking to you.' He said, 'Lord, I believe,' and he worshiped him. Jesus said, 'For judgment I came into this world, that those who do not see may see, and those who see may become blind.' Some of the Pharisees near him heard these things, and said to him, 'Are we also blind?' Jesus said to them, 'If you were blind, you would have no guilt; but now that you say, \"We see,\" your guilt remains. Truly, truly, I say to you, he who does not enter the sheepfold by the door but climbs in by another way, that man is a thief and a robber. But he who enters by the door is the shepherd of the sheep. To him the gatekeeper opens. The sheep hear his voice, and he calls his own sheep by name and leads them out. When he has brought out all his own, he goes before them, and the sheep follow him, for they know his voice. A stranger they will not follow, but they will flee from him, for they do not know the voice of strangers.' This figure of speech Jesus used with them, but they did not understand what he was saying to them. So Jesus again said to them, 'Truly, truly, I say to you, I am the door of the sheep. All who came before me are thieves and robbers, but the sheep did not listen to them. I am the door. If anyone enters by me, he will be saved and will go in and out and find pasture. The thief comes only to steal and kill and destroy. I came that they may have life and have it abundantly. I am the good shepherd. The good shepherd lays down his life for the sheep. He who is a hired hand and not a shepherd, who does not own the sheep, sees the wolf coming and leaves the sheep and flees, and the wolf snatches them and scatters them. He flees because he is a hired hand and cares nothing for the sheep. I am the good shepherd. I know my own and my own know me, just as the Father knows me and I know the Father; and I lay down my life for the sheep. And I have other sheep that are not of this fold. I must bring them also, and they will listen to my voice. So there will be one flock, one shepherd. For this reason the Father loves me, because I lay down my life that I may take it up again. No one takes it from me, but I lay it down of my own accord. I have authority to lay it down, and I have authority to take it up again. This charge I have received from my Father.' There was again a division among the Jews because of these words. Many of them said, 'He has a demon, and is insane; why listen to him?' Others said, 'These are not the words of one who is oppressed by a demon. Can a demon open the eyes of the blind?' At that time the Feast of Dedication took place at Jerusalem. It was winter, and Jesus was walking in the temple, in the colonnade of Solomon. So the Jews gathered around him and said to him, 'How long will you keep us in suspense? If you are the Christ, tell us plainly.' Jesus answered them, 'I told you, and you do not believe. The works that I do in my Father's name bear witness about me, but you do not believe because you are not among my sheep. My sheep hear my voice, and I know them, and they follow me. I give them eternal life, and they will never perish, and no one will snatch them out of my hand. My Father, who has given them to me, is greater than all, and no one is able to snatch them out of the Father's hand. I and the Father are one.' The Jews picked up stones again to stone him. Jesus answered them, 'I have shown you many good works from the Father; for which of them are you going to stone me?' The Jews answered him, 'It is not for a good work that we are going to stone you but for blasphemy, because you, being a man, make yourself God.' Jesus answered them, 'Is it not written in your Law, \"I said, you are gods\"? If he called them gods to whom the word of God came—and Scripture cannot be broken—do you say of him whom the Father consecrated and sent into the world, \"You are blaspheming,\" because I said, \"I am the Son of God\"? If I am not doing the works of my Father, then do not believe me; but if I do them, even though you do not believe me, believe the works, that you may know and understand that the Father is in me and I am in the Father.' Again they sought to arrest him, but he escaped from their hands. He went away again across the Jordan to the place where John had been baptizing at first, and there he remained. And many came to him. And they said, 'John did no sign, but everything that John said about this man was true.' And many believed in him there."
    }
  ],
  "segments": [
    {
      "segment_id": "orientation",
      "type": "orientation",
      "audio_script": "Jesus performs His sixth sign, healing a man born blind. Today we explore the Pharisees' stubborn rejection and Jesus' teaching as the Door and the Good Shepherd who lays down His life for the sheep."
    },
    {
      "segment_id": "reading",
      "type": "reading",
      "audio_script": "Listen to John chapters 9 and 10. Jesus saw a man blind from birth. His disciples asked, 'Who sinned, this man or his parents?' Jesus answered, 'It was not that this man sinned, or his parents, but that the works of God might be displayed in him. As long as I am in the world, I am the light of the world.' He spit on the ground and made mud with the saliva. Then he anointed the man's eyes with the mud and said, 'Go, wash in the pool of Siloam.' So he went and washed and came back seeing. They brought to the Pharisees the man who had formerly been blind. Now it was a Sabbath day when Jesus made the mud and opened his eyes. Some of the Pharisees said, 'This man is not from God, for he does not keep the Sabbath.' They did not believe until they called the parents. His parents feared the Jews, for they had agreed that if anyone should confess Jesus to be Christ, he was to be put out of the synagogue. For the second time they called the man and said, 'Give glory to God. We know that this man is a sinner.' He answered, 'Whether he is a sinner I do not know. One thing I do know, that though I was blind, now I see. You do not know where he comes from, and yet he opened my eyes. Never since the world began has it been heard that anyone opened the eyes of a man born blind. If this man were not from God, he could do nothing.' They cast him out. Jesus heard and found him and said, 'Do you believe in the Son of Man?' He answered, 'And who is he, sir?' Jesus said, 'You have seen him, and it is he who is speaking to you.' He said, 'Lord, I believe,' and he worshiped him. Jesus said, 'Truly, truly, I say to you, I am the door of the sheep. If anyone enters by me, he will be saved and will go in and out and find pasture. The thief comes only to steal and kill and destroy. I came that they may have life and have it abundantly. I am the good shepherd. The good shepherd lays down his life for the sheep. He who is a hired hand sees the wolf coming and leaves the sheep and flees. I am the good shepherd. I know my own and my own know me, just as the Father knows me and I know the Father; and I lay down my life for the sheep. I have other sheep that are not of this fold. I must bring them also. So there will be one flock, one shepherd. I lay down my life that I may take it up again. No one takes it from me, but I lay it down of my own accord. I have authority to lay it down, and I have authority to take it up again.' At the Feast of Dedication the Jews said, 'If you are the Christ, tell us plainly.' Jesus answered, 'I told you, and you do not believe. My sheep hear my voice, and I know them, and they follow me. I give them eternal life, and they will never perish, and no one will snatch them out of my hand. My Father, who has given them to me, is greater than all. I and the Father are one.' The Jews picked up stones to stone him. Jesus answered, 'For which good work are you going to stone me?' The Jews answered, 'For blasphemy, because you, being a man, make yourself God.'"
    },
    {
      "segment_id": "context",
      "type": "context",
      "audio_script": "Jesus heals a man born blind on the Sabbath—the sixth sign. The Pharisees interrogate the healed man and his parents, refusing to believe Jesus is from God. They excommunicate the man for his testimony. Jesus finds him and reveals Himself as the Son of Man, and the man worships Him. Jesus then teaches He is the Door for the sheep, providing salvation and abundant life. He is the Good Shepherd who lays down His life for the sheep and will take it up again. At the Feast of Dedication, Jesus declares His unity with the Father. The Jews attempt to stone Him for blasphemy, but He escapes."
    },
    {
      "segment_id": "analysis",
      "type": "analysis",
      "audio_script": "The blind man's healing demonstrates Jesus as the Light of the World bringing spiritual sight. The Pharisees' spiritual blindness contrasts with the healed man's growing faith. The healed man's testimony is simple yet powerful: 'Though I was blind, now I see.' He moves from calling Jesus a man to prophet to Lord, worshiping Him. Jesus is 'the Door'—the only way of salvation. He is 'the Good Shepherd' who knows His sheep, calls them by name, and lays down His life voluntarily. Unlike hired hands, He protects the sheep from wolves. Other sheep refers to Gentiles, creating one flock. His authority to lay down and take up His life shows control over His death and resurrection. 'I and the Father are one' claims essential unity and deity, which the Jews recognize as a claim to be God."
    },
    {
      "segment_id": "themes",
      "type": "themes",
      "audio_script": "Key themes include Jesus as Light bringing sight to the blind, spiritual blindness of religious leaders, the cost of following Jesus, Jesus as the Door to salvation, Jesus as the Good Shepherd laying down His life, knowing and being known by Jesus, eternal security of the sheep, one flock from many peoples, Jesus' voluntary death and resurrection, and unity with the Father. John emphasizes Jesus' sacrificial love and divine authority."
    },
    {
      "segment_id": "question",
      "type": "question",
      "audio_script": "Reflect on this: Have you experienced Jesus opening your blind eyes? Can you testify, 'Though I was blind, now I see'? Have you entered through the Door? Do you hear the Good Shepherd's voice and follow Him? Do you believe He and the Father are one?"
    },
    {
      "segment_id": "close",
      "type": "close",
      "audio_script": "Jesus is the Light giving sight to the blind, the Door providing salvation, and the Good Shepherd laying down His life for the sheep. He is one with the Father. Next, we'll witness the seventh sign: Lazarus raised from the dead. Well done."
    }
  ],
  "metadata": {
    "difficulty": "intermediate",
    "testament": "new",
    "book": "john",
    "chapter_range": "9-10",
    "theological_themes": ["man_born_blind", "light_of_world", "spiritual_blindness", "the_door", "good_shepherd", "i_am_statements", "laying_down_life", "eternal_security", "one_with_father"],
    "time_period": "circa_28_ad",
    "canonical_order": 43
  }
}
