{
  "lesson_id": "herm01_lesson_01",
  "course_id": "hermeneutics_i",
  "sequence": 1,
  "title": "Observation: Noticing the Text",
  "objective": "Develop precise observation skills to list textual details and features",
  "duration_estimate": "6 minutes",
  "prerequisite": null,
  "required_passages": [
    {
      "passage_id": "mar_1_1_15",
      "reference": "Mark 1:1-15",
      "text": "The beginning of the gospel of Jesus Christ. John appeared in the wilderness calling for repentance. Jesus was baptized, the Spirit descended on Him, and the voice from heaven declared, You are my beloved Son. Jesus proclaimed, The time is fulfilled, and the kingdom of God is at hand; repent and believe the gospel."
    }
  ],
  "segments": [
    {
      "type": "orientation",
      "sequence": 1,
      "audio_script": "This is lesson one in Hermeneutics One. Focus on observing the text carefully.",
      "word_count": 14
    },
    {
      "type": "reading",
      "sequence": 2,
      "passage_id": "mar_1_1_15",
      "audio_script": "Listen to the passage. Mark 1:1-15. The beginning of the gospel of Jesus Christ. John appeared in the wilderness calling for repentance. Jesus was baptized, the Spirit descended on Him, and the voice from heaven declared, You are my beloved Son. Jesus proclaimed, The time is fulfilled, and the kingdom of God is at hand; repent and believe the gospel. Now identify repeated words, transitions, and how each sentence builds the flow of the passage.",
      "word_count": 77
    },
    {
      "type": "context",
      "sequence": 3,
      "audio_script": "Observation includes noting repetition, key terms, conjunctions, and sentence boundaries. These features guide interpretation.",
      "word_count": 21
    },
    {
      "type": "analysis",
      "sequence": 4,
      "audio_script": "Ask what the text says first before asking why. Avoid imposing background assumptions during observation. Keep it descriptive.",
      "word_count": 22
    },
    {
      "type": "themes",
      "sequence": 5,
      "audio_script": "Key skill: careful description. Accurate observation prevents anachronistic readings and prepares for context analysis.",
      "word_count": 18
    },
    {
      "type": "question",
      "sequence": 6,
      "audio_script": "What is the first step in the historical-grammatical method?",
      "correct_answer": "Observation",
      "acceptable_variants": [
        "Observe",
        "Noticing the text"
      ],
      "word_count": 9
    },
    {
      "type": "close",
      "sequence": 7,
      "audio_script": "This completes lesson one. Next lesson applies observation to immediate literary context.",
      "word_count": 14
    }
  ],
  "vocabulary": [
    {
      "term": "observation",
      "definition": "Careful noting of textual features without interpretation"
    }
  ],
  "study_notes": "Observation is the foundational discipline. Spend time listing explicit data before inference.",
  "metadata": {
    "created": "2026-02-10",
    "version": "1.0",
    "content_reviewed": false,
    "audio_recorded": false
  }
}
