{
  "lesson_id": "herm01_lesson_02",
  "course_id": "hermeneutics_i",
  "sequence": 2,
  "title": "Immediate Context",
  "objective": "Learn how surrounding verses and paragraphs shape meaning",
  "duration_estimate": "6 minutes",
  "prerequisite": "herm01_lesson_01",
  "required_passages": [
    {
      "passage_id": "php_4_4_9",
      "reference": "Philippians 4:4-9",
      "text": "Rejoice in the Lord always. Let your gentleness be known to all. Do not be anxious, but in everything by prayer and thanksgiving let your requests be made known to God, and the peace of God will guard your hearts and minds in Christ Jesus. Think on what is true, honorable, just, pure, lovely, and commendable, and practice these things."
    }
  ],
  "segments": [
    {
      "type": "orientation",
      "sequence": 1,
      "audio_script": "This is lesson two. Focus on the immediate literary context of a passage.",
      "word_count": 14
    },
    {
      "type": "reading",
      "sequence": 2,
      "passage_id": "php_4_4_9",
      "audio_script": "Listen to the passage. Philippians 4:4-9. Rejoice in the Lord always. Let your gentleness be known to all. Do not be anxious, but in everything by prayer and thanksgiving let your requests be made known to God, and the peace of God will guard your hearts and minds in Christ Jesus. Think on what is true, honorable, just, pure, lovely, and commendable, and practice these things. Now identify how each command and promise connects to the sentences before and after it.",
      "word_count": 83
    },
    {
      "type": "context",
      "sequence": 3,
      "audio_script": "Immediate context clarifies referents, tense, and flow of argument. Many apparent contradictions resolve with context.",
      "word_count": 22
    },
    {
      "type": "analysis",
      "sequence": 4,
      "audio_script": "Map how sentences connect. Note transitions like then and for; these signal logical relations.",
      "word_count": 19
    },
    {
      "type": "themes",
      "sequence": 5,
      "audio_script": "Key idea: never interpret a verse in isolation. Context governs meaning and prevents misreading.",
      "word_count": 15
    },
    {
      "type": "question",
      "sequence": 6,
      "audio_script": "What should you read alongside a verse to understand it?",
      "correct_answer": "Immediate context",
      "acceptable_variants": [
        "Surrounding verses",
        "Paragraph context"
      ],
      "word_count": 11
    },
    {
      "type": "close",
      "sequence": 7,
      "audio_script": "This completes lesson two. Next lesson examines historical setting and original audience.",
      "word_count": 12
    }
  ],
  "vocabulary": [
    {
      "term": "immediate context",
      "definition": "The verses and paragraphs directly surrounding a text that shape its meaning"
    }
  ],
  "study_notes": "Always expand reading window to include immediate context before analysis.",
  "metadata": {
    "created": "2026-02-10",
    "version": "1.0",
    "content_reviewed": false,
    "audio_recorded": false
  }
}
